{"title":"Bib Manual","slug":"bib-manual","html":"<h2 id=\"undefinedmeet-bib-shy-spider-with-a-big-heart-and-a-talent-for-stereo-fx\">Meet Bib, shy spider with a big heart... and a talent for stereo FX</h2>\n<img src=\"/bibspin.gif\">\n\n<h2 id=\"undefinedoverview\">Overview</h2>\n<p>Bib is the first collaboration between Alex Evans - creator of Plinky! - and Ray Yokell aka CrazyEmperor893 of <a href=\"https://crey.space\">The crey emporium</a>. </p>\n<p>Bib is a shy spider with a big heart. She first drives the signal (red page), then feeds it through a stereo delay (green page), then reverb (blue page), then finally a wet/dry mix and final output volume control (white page). </p>\n<p>Bib has a rear-panel 6 pin audio header compatible with Intellijel and other makers&#39; case jacks and jack modules, one TRS stereo input and one TRS stereo output which can drive line or headphones with ease. </p>\n<p>Tap on the spider to set the delay tempo, long press (pressure sensitive!) to set the reverb shimmer amount, and drag across the touch strip at the bottom of the panel to influence the delay, like touching the tape of a tape delay. </p>\n<p>Simply select a page to edit by touching one of the four sections on the touch strip, then twist the knobs to change the two parameters associated with each page.</p>\n<p>You can clock the delay by feeding a regular trigger into the CV input, or assign the CV input as a modulation source by tapping the strip 3 times (led will flash rainbow) then turning any knob(s) you want it to control.</p>\n<h2 id=\"undefinedone-page-cheat-sheet\">One page cheat sheet</h2>\n<p><a href=\"bib_manual.png\" target=\"blank\"><img src=\"bib_manual.png\"></a></p>\n","date":"2024-09-07T08:38:00.000Z","excerpt":"","printDate":"September 7, 2024","toc":[{"anchor":"undefinedmeet-bib-shy-spider-with-a-big-heart-and-a-talent-for-stereo-fx","level":2,"text":"Meet Bib, shy spider with a big heart... and a talent for stereo FX"},{"anchor":"undefinedoverview","level":2,"text":"Overview"},{"anchor":"undefinedone-page-cheat-sheet","level":2,"text":"One page cheat sheet"}]}