{"title":"Bib Manual","slug":"bib-manual","html":"<h2 id=\"meet-bib-shy-spider-with-a-big-heart-and-a-talent-for-stereo-fx\">Meet Bib, shy spider with a big heart... and a talent for stereo FX</h2>\n<img src=\"/bibspin.gif\">\n\n<p>If you&#39;re looking for the build guide, go <a href=\"docs/build-guide_bib\">here</a>.</p>\n<p>The latest firmware is available to download at the bottom of this page. </p>\n<h2 id=\"video-demo-and-jam-by-izaak-from-toadstool-tech\">Video demo and Jam by izaak from toadstool.tech</h2>\n<div class=\"Video\">\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/c-n1z9zD5Pw?si=tRR9bGGUOqtbDU-O\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>\n</div>\n\n\n<h2 id=\"overview\">Overview</h2>\n<p>Bib is the first collaboration between Alex Evans - creator of Plinky! - and Ray Yokell aka CrazyEmperor893 of <a href=\"https://crey.space\">The crey emporium</a>. </p>\n<p>Bib is a shy spider with a big heart. She first drives the signal (red page), then feeds it through a stereo delay (green page), then reverb (blue page), then finally a wet/dry mix and final output volume control (white page). </p>\n<p>Bib has a rear-panel 6 pin audio header compatible with Intellijel and other makers&#39; case jacks and jack modules, one TRS stereo input and one TRS stereo output which can drive line or headphones with ease. </p>\n<p>Tap on the spider to set the delay tempo, long press (pressure sensitive!) to set the reverb shimmer amount, and drag across the touch strip at the bottom of the panel to influence the delay, like touching the tape of a tape delay. </p>\n<p>Simply select a page to edit by touching one of the four sections on the touch strip, then twist the knobs to change the two parameters associated with each page.</p>\n<p>You can clock the delay by feeding a regular trigger into the CV input, or assign the CV input as a modulation source by tapping the strip 3 times (led will flash rainbow) then turning any knob(s) you want it to control.</p>\n<h2 id=\"one-page-cheat-sheet\">One page cheat sheet</h2>\n<p><a href=\"bib_manual.png\" target=\"blank\"><img src=\"bib_manual.png\"></a></p>\n<h2 id=\"enabling-and-disabling-the-line-in-connection\">Enabling and Disabling the line-in connection</h2>\n<p>Bib has stereo eurorack level inputs and outputs on its front panel, but also sports a 6 pin header on its back for line level stereo in and out. These are compatible, for example, with the intellijel palette cases, allowing use of two case mounted TRS jacks as stereo in/out. </p>\n<p>However, the line-in connection when unused can, in some cases and environments, pick up a bit of noise. For that reason, we added an option in the Bib software to enable and disable this line-in connection. If you&#39;re not using the line-in feature, you can disable it by pressing and holding firmly on both the spider and the slider for 5 or more seconds. </p>\n<p>After 2 seconds, the knob will pulse white, indicating that all settings have been reset. Keep holding! After 5 seconds, it will pulse either red (line-in disabled) or green (line-in enabled). Release your fingers. Hold again for 5 seconds to toggle as needed.</p>\n<p>This feature was added in version 3 of the firmware, which is the version flashed to all Thonk bibs and crey.emporium bibs sold <em>after</em> knobconn 24.</p>\n<p>The line-out and front panel connections are always enabled, ie they are not affected by this setting.</p>\n<h2 id=\"firmware\">Firmware</h2>\n<p>First, download the latest firmware in this file: <a href=\"bib-firmware/bib_006.uf2\"><code>bib_006.uf2</code></a>.\nUse a USB-C cable (not included) to plug your computer into Bib. You do <strong>not</strong> need Bib to be powered from eurorack for this step. </p>\n<p>Bib should show up as a USB drive called <code>RPI-RP2</code> (on mac, you may find it under <code>/Volumes/RPI-RP2</code>). If it does not, try disconnecting the USB cable, holding down the <em>tiny</em> button on the digital board, just  opposite to the USB connector (hilighted below), while reconnecting the cable - then release the button. If it <em>still</em> doesn&#39;t show up, make sure your cable has data lines (and isn&#39;t just for charging).</p>\n<p>Drag and drop or otherwise copy the downloaded file onto the RPI-RP2 folder, and after a second Bib should reboot, flashing white and then glowing red. You&#39;re ready to bib!</p>\n<h2 id=\"patch-notes-versions\">Patch notes &amp; versions</h2>\n<h2 id=\"v6-end-october-2024-oops-edition-\">v6 - End October 2024 - &#39;Oops edition&#39;</h2>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"bib-firmware/bib_006.uf2\">Download here: bib_006.uf2</a></p>\n<ul>\n<li>Allow for slightly longer presses on the slider to count as a tap</li>\n<li>BUGFIX! Ooops, some grotty &#39;grumbling&#39; had crept into the delay. much better now.</li>\n<li>BUGFIX! Ooops, the tape stop and tape speed wobble effects were broken in 005. fixed!</li>\n</ul>\n<h2 id=\"v5-start-october-2024-timo-edition-\">v5 - Start October 2024 - &#39;Timo edition&#39;</h2>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"bib-firmware/bib_005.uf2\">Download here: bib_005.uf2</a></p>\n<ul>\n<li>The touch sensitivity is improved, and some users reported the spider &#39;locking up&#39; and becoming unresponsive after a while, which should be fixed.</li>\n</ul>\n<h2 id=\"v4-september-2024-toadstool-edition-\">v4 - September 2024 - &#39;Toadstool edition&#39;</h2>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"bib-firmware/bib_004.uf2\">Download here: bib_004.uf2</a></p>\n<ul>\n<li>The spider now has different functions depending on the mode: <ul>\n<li>in red it toggles between a new wavefolder / old overdrive </li>\n<li>in green it does tap tempo as before</li>\n<li>in blue it sets shimmer amount as before</li>\n<li>in white it is a new &#39;dub mute&#39; feature: while holding temporarily it sets main red = OFF (mute input) and green feedback = FULL (freeze the delay).</li>\n</ul>\n</li>\n<li>shimmer is now cyan, not peach; and the delay mode&#39;s blue shifts from blue to cyan to show how much shimmer is in at all times</li>\n<li>new wavefolder mode! in drive mode (red), the red color turns pink when in wavefolder mode. you tap spider to toggle (in red mode).</li>\n<li>the drive &amp; wavefolder are 2x more oversampled than before so feel less digital</li>\n<li>the touch strip only changes mode on tap, not swipe (less confusing)</li>\n<li>the knob glows brighter by default</li>\n<li>rebalanced the parameter curves for the delay, now the &#39;short end&#39; of delay time is super fun for KS type string sounds (but mad, because, bib)</li>\n</ul>\n<h2 id=\"v3-august-2024-thonk-edition-\">v3 - August 2024 - &#39;Thonk edition&#39;</h2>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"bib-firmware/bib_003.uf2\">Download here: bib_003.uf2</a></p>\n<ul>\n<li>add visual feedback on factory reset, and ability to switch on/off the line input</li>\n<li>this is the version flashed onto first run Thonk kits</li>\n</ul>\n<h2 id=\"v2-july-2024-knobconn-edition-\">v2 - July 2024 - &#39;Knobconn edition&#39;</h2>\n<p><a target=\"_blank\" rel=\"nofollow\" href=\"bib-firmware/bib_002.uf2\">Download here: bib_002.uf2</a></p>\n<ul>\n<li>fixed a &#39;spider pressure overflow&#39; 16 bit bug. this is the earliest usable firmware</li>\n</ul>\n","date":"2024-09-07T08:38:00.000Z","excerpt":"","printDate":"September 7, 2024","toc":[{"anchor":"meet-bib-shy-spider-with-a-big-heart-and-a-talent-for-stereo-fx","level":2,"text":"Meet Bib, shy spider with a big heart... and a talent for stereo FX"},{"anchor":"video-demo-and-jam-by-izaak-from-toadstool-tech","level":2,"text":"Video demo and Jam by izaak from toadstool.tech"},{"anchor":"overview","level":2,"text":"Overview"},{"anchor":"one-page-cheat-sheet","level":2,"text":"One page cheat sheet"},{"anchor":"enabling-and-disabling-the-line-in-connection","level":2,"text":"Enabling and Disabling the line-in connection"},{"anchor":"firmware","level":2,"text":"Firmware"},{"anchor":"patch-notes-versions","level":2,"text":"Patch notes &amp; versions"},{"anchor":"v6-end-october-2024-oops-edition-","level":2,"text":"v6 - End October 2024 - &#39;Oops edition&#39;"},{"anchor":"v5-start-october-2024-timo-edition-","level":2,"text":"v5 - Start October 2024 - &#39;Timo edition&#39;"},{"anchor":"v4-september-2024-toadstool-edition-","level":2,"text":"v4 - September 2024 - &#39;Toadstool edition&#39;"},{"anchor":"v3-august-2024-thonk-edition-","level":2,"text":"v3 - August 2024 - &#39;Thonk edition&#39;"},{"anchor":"v2-july-2024-knobconn-edition-","level":2,"text":"v2 - July 2024 - &#39;Knobconn edition&#39;"}]}