{"title":"Bib build guide - V1","slug":"build-guide_bib_v1","html":"<p>Hello! Welcome to the Bib <del>build</del> bibld guide.\nBib is quite a simple build, and fairly beginner friendly. </p>\n<img src=\"/bibspin.gif\">\n\n<p><strong>You will need:</strong> a soldering iron, side cutters, a bib kit, and a little patience.</p>\n<p>Below are most of the parts of the Bib kit, with the exception of the Eurorack power cable, mounting hardware, and for no reason other than my forgetfulness, a small 4 pin SMD socket that we will meet shortly:</p>\n<p><img src=\"/bib-build-guide/IMG_6306.jpeg\" alt=\"Parts\"></p>\n<h2 id=\"the-headers-a-nice-warmup\">The headers - a nice warmup</h2>\n<p>Let&#39;s get the two &#39;SMD&#39; headers out of the way - the small 4 pin socket for the front panel which I missed out of the photo above, and a 2x3 pin header that you can use to connect line level stereo input and headphone output to the quarter inch TRS jacks on an intellijel palette case, for example.</p>\n<p>Your small socket should have 4 &#39;holes&#39; - but it may have 8 legs (like the one pictured), or 4 in an alternating pattern (2 on each side). Either works! The footprint has 8 pads to accomodate either type.</p>\n<p>Put a small pillow of solder on a <em>single</em> pin on each footprint - one on the front panel, one on the main circuit board, as hilighted in yellow below. Again - just a single pin each for now!</p>\n<p><img src=\"/bib-build-guide/IMG_6307.jpeg\" alt=\"Solder one pin\"></p>\n<p>now line up the socket and use your iron to heat up the pollow and solder that first pin. It&#39;s worth getting the socket nice and straight, centered, and upright while only 1 pin is soldered. </p>\n<p>Don&#39;t bend it! just touch your iron to re-heat it and gently move the socket into place while the solder is melted. Once you&#39;re happy, it should look like this:</p>\n<p float=\"left\">\n  <img src=\"/bib-build-guide/IMG_6308.jpeg\" width=\"42%\" />\n  <img src=\"/bib-build-guide/IMG_6309.jpeg\" width=\"45%\" />\n  <img src=\"/bib-build-guide/IMG_6310.jpeg\" width=\"88%\" />\n</p>\n\n<p>Now solder the remaining pins on the two connectors. Be careful on the mainboard not to disturb any of the tiny, pre-soldered components. The trick with soldering is to make sure your iron is warming both the pin to be soldered, and the pad it rests on. Heat them together for 1 or 2 seconds, then add a touch of solder. It should flow across both the pin and the pad, to make a nice soldered connection. Feel free to touch up the original &#39;anchor&#39; pin on each connector.</p>\n<p>Lastly, gently break the spare &#39;rails&#39; off the edges of the main board, using a pair of pliers and gentle pressure. When separating the two halves of the main board, I use my fingers and try to avoid &#39;flexing&#39; either board - there are tiny hair thin metal traces inside the fiberglass, so you don&#39;t want to flex it too much. Once you&#39;re done, you should have 3 boards: the front panel with the 4 pin socket you just soldered, an analog board with the 6 pin header, and the digital board with the USB-C port on it. Lovely!</p>\n<p><img src=\"/bib-build-guide/IMG_6312.jpeg\" alt=\"Parts\"></p>\n<h2 id=\"preparing-the-pins\">Preparing the pins</h2>\n<p>If your kit came with a 36 pin strip and a 5x2 pin &#39;block&#39;, then break the 36 pin strip into a section of 4, 12, 12 pins (and 8 spare). You&#39;ll use the 5x2 for the power.</p>\n<p>If your kit came with a single strip of 40 breakable pins, break it apart now into 5, 5, 4, 12, 12 pin sections - you&#39;ll use the pair of 5s to make the power header:</p>\n<p><img src=\"/bib-build-guide/IMG_6313.jpeg\" alt=\"Parts\"></p>\n<p>Connect the 12 pin pieces with the corresponding sockets, and push the 5 pin pieces into the eurorack power cable to line them up:</p>\n<p><img src=\"/bib-build-guide/IMG_6314.jpeg\" alt=\"Parts\"></p>\n<h2 id=\"soldering-the-eurorack-power-pins\">Soldering the eurorack power pins</h2>\n<p>Now, with the cable still attached, put the 5x2 power pins into the back of the digital board, where it says &#39;POWER EITHER WAY&#39;. You can ignore the &#39;expander&#39; 5x2 holes, as the bib expander hasn&#39;t been designed yet. Better to leave it unpopulated for now, so you don&#39;t accidentally plug power into it in the future. :)</p>\n<p>Turn it over, and solder the 10 power header pins. Again, <strong>be careful to avoid melting or disturbing the tiny pre-soldered parts</strong>, and be sure to heat both the pad and the pin before adding solder. These pins are actually the hardest to solder in the entire project, because they are connected to lots of copper inside the board, and will &#39;suck up&#39; a lot of heat. Don&#39;t be afraid to really heat them up, to allow the solder to form a nice joint. Don&#39;t just add lots of solder! If you bridge some of the central 6 pins (ie the center 2x3) that&#39;s not the end of the world, as they are all &#39;ground&#39; - but it&#39;s ugly! :) It will work though. The 2 pins on each end are +12 and -12, so you dont want to bridge them to the center, lest you short out your eurorack power supply. Take your time, it&#39;ll be ok!  </p>\n<p><img src=\"/bib-build-guide/IMG_6346.jpeg\" alt=\"Parts\"></p>\n<h2 id=\"making-the-sandwich-12-pin-headers\">Making the sandwich: 12 pin headers</h2>\n<p>Ok now pop the 12 pin header+pin combos you made into both boards - we are joining them together in a kind of Bib-ish silicon sandwich. The pre-soldered components go on the inside of the sandwich, you see. Turn the board over to see the back with the Power pins you just soldered, and solder the two rows of 12 header pins, as shown below. <strong>WE ARE ONLY SOLDERING THIS ONE SIDE! DONT JUMP AHEAD TO THE OTHER SIDE!</strong> I tend to solder a <em>single</em> pin first, and make sure it is all nice and square and flush, before soldering the rest. That&#39;s a good trick with multipin parts in general - do one pin, line it up, then do the rest when you&#39;re happy. It&#39;s much easier to align a single pin, than it is to fix things when you&#39;ve soldered 12 wonky. Ask me how I know... Oh, while you&#39;re here, maybe melt a bit of solder into the USB-C connector&#39;s holes, if they are not already full. It just adds a bit of mechanical rigidity.</p>\n<p><img src=\"/bib-build-guide/IMG_6318.jpeg\" alt=\"Parts\"></p>\n<p>OK! Flip Bib over but <strong>DONT SOLDER THE OTHER SIDE YET</strong>. First we need to trim the pins flush in the hilighted areas below. Use side cutters and cut them flush to the board - the pin is still inside the hole, but shouldn&#39;t poke up. PLEASE WEAR EYE PROTECTION and make sure no children/pets are near by. the little bits of metal tend to &#39;ping&#39; off. Be careful.</p>\n<p>Why trim them? It&#39;s to avoid the pins shorting out on the underside of the knobs we&#39;ll add later. 1U is cramped! Once you&#39;ve trimmed them, go ahead and solder all 24 pins. Your sandwich should be nice and solid now! To prove it to yourself, feel free to gently pull it apart, setting the digital board aside for a bit.</p>\n<p><img src=\"/bib-build-guide/IMG_6319.jpeg\" alt=\"Parts\"></p>\n<h2 id=\"trimming-the-pots\">Trimming the pots</h2>\n<p>Ok let&#39;s prepare the pots (aka knobs)! Both the pots have standoffs that get in the way. use sharp side cutters, wear eye protection, avoid curious pets/kids, and get rid of the little metal tabs shown in yellow below (one on the small pot, two on the bigger pot). While you&#39;re here, I tend to find the wiggly pins on the smaller pot a bit too wiggly for my taste - I flatten them very slightly with a gentle squeeze of some pliers. if you struggle to fit the pot into the board later, this&#39;ll help.</p>\n<p float=\"left\">\n  <img src=\"/bib-build-guide/IMG_6355.jpeg\" width=\"60%\" />\n  <img src=\"/bib-build-guide/IMG_6354.jpeg\" width=\"38%\" />\n</p>\n\n<h2 id=\"placing-the-hardware-but-not-soldering-it-\">Placing the hardware (but not soldering it)</h2>\n<p>OK Now we&#39;re ready to put all the pots and sockets into Bib! prise the sandwich gently apart, if you didn&#39;t already, and put the digital half aside - it&#39;s finished actually! (Feel free to have a celebratory cup of tea). Freshly revitalised, <strong>remove the nut and washer</strong> from the smaller pot, then place them along with the 5 Thonk jack sockets, and don&#39;t forget the little 4 pin header - as shown below. (You can leave the nut on the larger, transparent pot, as it helps alignment later, and the kit should contain a separate black nut to fit over the top, later.) <strong>DONT SOLDER ANYTHING YET!</strong> Just plop &#39;em in place. The stereo pairs of thonkiconns actually share a single hole for the &#39;ground&#39; pins, so it can be a bit fiddly, but you can do it! I believe in you!</p>\n<p><img src=\"/bib-build-guide/IMG_6326.jpeg\" alt=\"Parts\"></p>\n<p>Why not solder them? You&#39;ll see! Now is the exciting moment we get to place the front panel over the top of everything. The pots and thonkis should all go through the holes (did you remember to remove the nut from the smaller pot, if one was there? good), perhaps after a little wiggling and persuasion (good thing you didn&#39;t solder them right!). The 4 pin header and the socket you soldered earlier should mesh together beautifully inside the sandwich. </p>\n<p>Take a moment to marvel at your achievement! I mean, why not loosely screw the nuts back on top of the panel to the pots and thonkis - it&#39;s really starting to look like a music thing now! Your kit probably included black nuts for the pots, which adds a certain <em>je ne sais quoi</em>... Alas, I didn&#39;t have those when I took the pictures below.</p>\n<p><img src=\"/bib-build-guide/IMG_6328.jpeg\" alt=\"Parts\"></p>\n<h2 id=\"ok-now-you-can-solder-the-hardware\">OK, NOW you can solder the hardware</h2>\n<p>At this point you should solder all of the pins poking through the bottom of the board. Don&#39;t forget any! The 3 pins of the main knob, and the pins of the thonkiconn that straddle the 6 pin SMD header, are especially hidden. They&#39;re all marked with yellow arrows in this picture:</p>\n<p><img src=\"/bib-build-guide/IMG_6351.jpeg\" alt=\"Not Kittens\"></p>\n<h2 id=\"hardware-victory\">Hardware Victory</h2>\n<p>My goodness! That was it! Double check you got <em>all</em> the solder joints above - are you SURE you got the 3 next to the white pins, or the two either side of the 6 pin SMD pin header? SURE? SURE? OK! - then just plug the digital board back into your freshly soldered analog board, forming a 3 level club sandwich of Bibness. Make sure you get it the right way around - as shown in the picture. If things are a little wonky, that&#39;s ok - look at mine! Wonky, but it works. That&#39;s the Bib way.</p>\n<p><img src=\"/bib-build-guide/IMG_6329.jpeg\" alt=\"Parts\">\n<img src=\"/bib-build-guide/IMG_6330.jpeg\" alt=\"Parts\"></p>\n<p>All that remains is to tighten the nuts, push the knobs onto the pot shafts, and we&#39;ll install some software!</p>\n<p><img src=\"/bib-build-guide/IMG_6331.jpeg\" alt=\"Parts\"></p>\n<h2 id=\"the-software-adventure\">The Software Adventure</h2>\n<p>Your Bib kit should come pre-flashed with firmware, so in theory it should just work straight away without any further ado. If you want, go and read the <a href=\"docs/bib-manual\">manual</a>.</p>\n<p>However, if you wish to update Bib, read on.</p>\n<p>First, download the firmware in this file: <a href=\"bib-firmware/bib_007.uf2\"><code>bib_007.uf2</code></a>. Patch notes are available on the manual page.</p>\n<p>Use a USB-C cable (not included) to plug your computer into Bib. You do <strong>not</strong> need Bib to be powered from eurorack for this step. </p>\n<p>Bib should show up as a USB drive called <code>RPI-RP2</code> (on mac, you may find it under <code>/Volumes/RPI-RP2</code>). If it does not, try disconnecting the USB cable, holding down the <em>tiny</em> button on the digital board, just  opposite to the USB connector (hilighted below), while reconnecting the cable - then release the button. If it <em>still</em> doesn&#39;t show up, make sure your cable has data lines (and isn&#39;t just for charging). And if that&#39;s definitely ok - maybe check your soldering?</p>\n<p><img src=\"/bib-build-guide/IMG_6352.jpeg\" alt=\"Parts\"></p>\n<p>Assuming the drive shows up, drag and drop the <code>bib_xxx.uf2</code> (where xxx is a version number) onto the drive. It should upload the software, and after a second, the main knob will flash white and then glow a dim red. That&#39;s a good sign! that means your Bib is working! </p>\n<p>If you want to fiddle right away, feel free to twist the knobs - the light should change brightness as you twist to reflect the position of the knob, and then revert to a dim glow when you release it. Pressing on the touch strip in each of the 4 zones marked <code>Drive</code>, <code>Echo</code>, <code>Verb</code>, <code>Mix</code> should cause the knob color to change Red/Green/Blue/White. If the touch is unresponsive, perhaps check your soldering - esepcially around the 4 pin socket and header on the front panel</p>\n<p>Assuming all seems well, disconnect it from your PC, carefully connect it to your eurorack system (the power cable can be fitted either way), and -  <em>Happy bibbing</em>!</p>\n<p>If you want, go and read the <a href=\"docs/bib-manual\">manual</a>.</p>\n","date":"2024-09-07T16:36:00.000Z","excerpt":"","printDate":"September 7, 2024","toc":[{"anchor":"the-headers-a-nice-warmup","level":2,"text":"The headers - a nice warmup"},{"anchor":"preparing-the-pins","level":2,"text":"Preparing the pins"},{"anchor":"soldering-the-eurorack-power-pins","level":2,"text":"Soldering the eurorack power pins"},{"anchor":"making-the-sandwich-12-pin-headers","level":2,"text":"Making the sandwich: 12 pin headers"},{"anchor":"trimming-the-pots","level":2,"text":"Trimming the pots"},{"anchor":"placing-the-hardware-but-not-soldering-it-","level":2,"text":"Placing the hardware (but not soldering it)"},{"anchor":"ok-now-you-can-solder-the-hardware","level":2,"text":"OK, NOW you can solder the hardware"},{"anchor":"hardware-victory","level":2,"text":"Hardware Victory"},{"anchor":"the-software-adventure","level":2,"text":"The Software Adventure"}]}