{"title":"Plinky+ build guide","slug":"build-guide-plus","html":"<p>This is the build guide for the Plinky+ kit. It&#39;s easy to identify:</p>\n<ul>\n<li>it&#39;s larger than original Plinky - 21 x 22 cm (8.23 x 8.66 inches)</li>\n<li>four knobs at the top - it has an extra potentiometer for volume</li>\n<li>all inputs and outputs are on the back panel</li>\n<li>powder-coated metal enclosure</li>\n</ul>\n<p>Check out the other build guide if you are building the original <a href=\"/docs/build-guide-plus\">24HP Plinky</a>.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0003.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Thank you for getting a Plinky+ DIY Kit. </p>\n<p>Plinky+ is an easy mechanical build. No soldering is required - all PCBs come pre-soldered.</p>\n<h3 id=\"some-tools-you-will-need\">Some tools you will need</h3>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0314.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<ul>\n<li>A Phillips screwdriver</li>\n<li>Tweezers</li>\n</ul>\n<h3 id=\"here-s-what-you-will-find-in-the-kit\">Here’s what you will find in the kit</h3>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0011.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<ul>\n<li>The front panel</li>\n</ul>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0026.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<ul>\n<li>The metal enclosure</li>\n<li>Battery cover</li>\n</ul>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0003.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<div class=\"three\">\n<div>\n\n<ul>\n<li>24x knurled nuts</li>\n<li>Back panel</li>\n<li>3.5 mm jack board</li>\n<li>6.35 mm jack board</li>\n<li>OLED screen board</li>\n<li>Mainboard with presoldered components</li>\n</ul>\n</div>\n<div>\n\n<ul>\n<li>4x M3 nuts</li>\n<li>2x 6.35 mm nuts</li>\n<li>1x 10mm hex spacer</li>\n<li>M3 washer</li>\n<li>3x knob caps with indicator</li>\n<li>1x encoder cap without indicator</li>\n</ul>\n</div>\n<div>\n\n<ul>\n<li>4x black hex nuts</li>\n<li>21x black M3 screws</li>\n<li>4x rubber feet</li>\n<li>Acrylic Lid</li>\n<li>Printed Manual</li>\n</ul>\n</div>\n</div>\n\n<h2 id=\"build-guide\">Build Guide</h2>\n<p>All of the soldered components on the PCB have already been assembled for you, so this is a very quick build. However, it does require careful handling of the PCBs and components.</p>\n<p>Avoid touching the SMD components with your hands and be careful not to bend or stress the boards. Take your time, and do not overtighten screws.</p>\n<h3 id=\"attach-the-back-panel\">Attach the back panel</h3>\n<p>The first step is to attach the back panel to the metal enclosure. </p>\n<p>The back panel sits inside the case. Four short M3 screws are inserted from the outside and held with four silver hex nuts on the inside. </p>\n<p>Slide the back panel into the case. Mind the orientation of the board: the silver labels above the jack cutouts face outside. \nThe slot for the USB-C connector sits on the left, with the big cutouts for the Main Out on the right. Any printed labels are right side up.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0030.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Take a silver nut and hold it against the inside of the panel. Use your finger or tweezers to align the nut and hold it in place. </p>\n<p>Using an M3 Phillips screwdriver, screw in each one of the black screws from the outside. Make sure to screw it all the way in, but don&#39;t over-tighten.</p>\n<div class=\"two\">\n\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0034.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0036.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n</div>\n\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0039.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<h3 id=\"assemble-mainboard-and-jacks\">Assemble Mainboard and Jacks</h3>\n<p>For this step you need the mainboard, and both the 3.5 mm and 6.35 mm jack boards.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0197.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Place the mainboard in front of you, so that the component side faces up and the potentiometers sit at the top. Any printed labels are right side up.</p>\n<p>The smaller of the two jack boards, the 6.35 mm jack board with the big jack connectors, attaches to the pin socket on the right side of the mainboard. Note that on this board, the PCB sits on top of the jacks.</p>\n<p>The 2x6 pinheader on the jack board slots into the 2x6 socket between encoder and stereo potentiometer. Line up the header with the socket and push the board in.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0203.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Next, place the 3.5 mm jack board, the longer of the two boards with two rows of jacks.\nThe on/off button faces to the left, and sits under the USB connector on the mainboard. </p>\n<p>The 2x27 pinheader on the jack board slots into the 2x27 socket on the mainboard. Note there&#39;s a second, separate socket that remains unconnected.</p>\n<p>The pins align with the socket on the right side. Line up the header with the socket and push the board in.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0210.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Once you have connected both the smaller 6.35 mm and the longer 3.5 mm jack board to the mainboard, you are ready for the next step.</p>\n<h3 id=\"place-mainboard-in-metal-enclosure\">Place mainboard in metal enclosure</h3>\n<p>The mainboard, with 6.35 mm and 3.5 mm jack board connected, needs to slot though the back panel so it sits in the metal enclosure. </p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0045.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>The best way to do this is to hold the mainboard at an angle, and align the jacks with the top row of cutouts of the back panel.</p>\n<p>Use the jacks and cutouts as a pivot point, and lower the back of the main board so the jacks slide through the panel.</p>\n<p>Gently push the board forward. It may be necessary to give the board a little wiggle, so all parts fit through the holes.</p>\n<p>If done correctly, all jacks slot through their corresponding cutout in the back panel. The mainboard sits on the standoffs so its 5 screw cutouts align with the standoffs themselves.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0050.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Now you are ready to screw the mainboard into the metal enclosure. </p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0051.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Take 4 of the black M3 screws. They go into the 3 positions on the bottom of the mainboard, and the one on the right side, under the volume potentiometer.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0054.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>The golden 10mm hex standoff goes into the position at the very top left, next to the USB-C jack, with the M3 silver washer between the standoff and the PCB.</p>\n<p>It&#39;s easiest to first place the M3 washer on the PCB, then screw in the gold metal spacer.</p>\n<div class=\"two\">\n\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0306.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0308.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n</div>\n\n\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0059.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<h3 id=\"place-the-knurled-nuts\">Place the knurled nuts</h3>\n<p>Once the mainboard is securely attached to the metal case, you need to place the knurled nuts to attach the jacks with the back panel.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0064.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Find the 24 knurled nuts. These go on the Thonkiconn jacks</p>\n<p>Then find the two 2 largest silver hex nuts. These go on the two 6.35 mm Main Out jacks.</p>\n<p>You can either use your fingers or a tool to tighten all 26 nuts. You can find tools for knurled nuts at <a target=\"_blank\" rel=\"nofollow\" href=\"https://michigansynthworks.com/products/nutzwinger\">Michigan Synthworks</a> and <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.exploding-shed.com/4x-nut-tool-set/100019\">Exploding Shed</a>, but if you are just doing these 26 here, doing them by hand will be fine. If you use a tool, be careful not to scratch the back panel.</p>\n<div class=\"two\">\n\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0065a.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0070a.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n</div>\n\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0074.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<h3 id=\"place-the-oled-board\">Place the OLED board</h3>\n<p>The OLED screen comes tested and pre-assembled on the OLED board. All you need to do is to fit it into the 3 small headers on the mainboard. </p>\n<p>Make sure the 3 pinheaders on the OLED Board align exactly with the sockets on the mainboard, then gently push the OLED board down into the sockets.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0083.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<h3 id=\"first-power-up\">First power up</h3>\n<p>Before placing the front panel, do a quick first power-up.</p>\n<p>Attach a USB-C cable to Plinky+. We recommend using a simple USB phone charger with around 1A power and a USB C to A cable.</p>\n<p>Then push the power button. Plinky+ will boot up and show the Plinky logo, then a calibration menu.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0096_power.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Now that you confirmed the OLED screen is assembled correctly, you can move on to finish the build. \nPress the on/off button again to power Plinky+ off and remove the USB cable. </p>\n<p>Now is also the best time to remove the anti-scratch cover from the OLED screen. It&#39;s a little translucent adhesive with a green plastic strip you can just lift off the screen.</p>\n<p>If you intend to install a built-in Battery Pack, and you have already sourced one, you may want to jump to that <a onclick=\"document.location.hash='installing-a-battery-pack';\" href=\"javascript:;\">chapter</a> and return here afterwards.\nNote that installing a Battery Pack is at your own risk. A suitable Battery Pack needs to be purchased separately through a third-party vendor.</p>\n<h3 id=\"place-the-front-panel\">Place the Front Panel</h3>\n<p>Take the Front Panel, printed side up. It needs to align with and slot over the potentiometer and encoder.</p>\n<p>The front panel has two grey 2x8 sockets on its underside, which line up exactly with the two 2x8 pin headers on the main board.</p>\n<p>Align the sockets and headers so that they match, and push the front panel down. </p>\n<p>Make sure that it is sitting flush and aligns with the metal case. You might need to carefully push it down around the sides to completely sit inside the case.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0107.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0108.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Check one last time that you removed the anti scratch cover from the OLED screen. </p>\n<h3 id=\"screw-down-the-front-panel\">Screw down the front panel</h3>\n<p>The cutouts in the front panel should align with the welded studs underneath. Use the remaining 9 black M3 screws and screw the front panel to the metal case.</p>\n<p>Now with the 4 black hex nuts, secure the 3 potentiometers and the encoder to the front panel.\nDon&#39;t overtighten the screws and the nuts, anything you can comfortably do by hand is perfect.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0118.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<h3 id=\"congratulations-your-build-is-done-\">Congratulations, your build is done!</h3>\n<p>The hardware part is done. Take a moment to appreciate the majesty of your crafting skills.</p>\n<p>Now is a good time to stick the 4 included rubber feet to the back plate. It&#39;s not strictly necessary to keep Plinky+ from moving around when sitting on a table top, but a good option if you are worried about scratching the surfaces Plinky+ sits on.</p>\n<p>They are self-adhesive. Peel them off the wax paper and place the rubber feet in all four corners of the back of the metal enclosure.</p>\n<p>Only once you’ve tested the functionality of your Plinky+, put on the aluminium knob caps.</p>\n<h3 id=\"power-up-your-plinky-and-calibration\">Power up your Plinky+ and Calibration</h3>\n<p>Connect Plinky+ to a power source (PC or Mac USB port, or USB power adapter) and push the on/off button to power it on.</p>\n<p>Plinky will go into touch calibration mode the first time it boots. Calibration mode is indicated on the display, and the bottom row of LEDs light up. You can watch the calibration process in this <a target=\"_blank\" rel=\"nofollow\" href=\"https://youtu.be/M9FH82lPIkM?t=2852\">video</a>.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0125.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<h3 id=\"touch-calibration\">Touch calibration</h3>\n<p>In calibration mode, one LED in each column will be lit. Press your finger evenly and as centrally as possible on one of the lit pads, medium hard (mezzo-forte) for a few seconds. After a few seconds, the LED will start blinking and you can release the pad. </p>\n<p>Plinky will ask you to do this for all 72 pads, by lighting them in turn.</p>\n<p>If you aren’t quite central with your finger, don’t release - just slide your finger into place with it held down, and keep it held down a few seconds once it’s central. \nIf you completely mess up, switch Plinky off and on again, and try again.</p>\n<p>Once you’ve finished, your Plinky is ready to play!</p>\n<p>You may need to recalibrate Plinky</p>\n<ul>\n<li>if it is responding offset to your finger presses</li>\n<li>if you buy a previously owned Plinky</li>\n</ul>\n<p>Twist the leftmost knob as Plinky powers up, then follow the steps described above.</p>\n<h3 id=\"put-on-the-knob-caps\">Put on the Knob Caps</h3>\n<p>Plug in headphones or speakers, play the touch surface with your fingertips and check whether you can hear audio. Use the righthand knob to carefully adjust the volume, start with a low setting first.</p>\n<p>Do a little test-drive. If everything is working fine, put on the knob caps. The caps have a profile for a D-shaft inside, so they are keyed to align correctly with the potentiometers and encoder.</p>\n<p>Potentiometers A, B and VOL each get a knob cap with a white indicator line, the Encoder P gets one without marking. If the knob is correctly aligned with the D-shaft, you can simply push it on.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0129.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<h3 id=\"happy-plinking\">Happy Plinking</h3>\n<p>Congratulations, the build is done! Happy Plinking!</p>\n<p>Please check out the <a target=\"_blank\" rel=\"nofollow\" href=\"https://plinkysynth.com/docs/play-guide\">Play Guide</a> and the <a target=\"_blank\" rel=\"nofollow\" href=\"https://plinkysynth.com/docs/manual\">Manual</a>.</p>\n<p>Plinky also has a browser-based patch editor at <a target=\"_blank\" rel=\"nofollow\" href=\"https://plinkysynth.github.io/editor/\">plinkysynth.github.io/editor</a>.\nYou will need a Web-Serial enabled browser like Google Chrome to run it, and allow it to connect with Plinky.\nOn Linux, you will need to <a onclick=\"document.location.hash='browser-based-patch-editor-linux';\" href=\"javascript:;\">grant hardware access</a> to Plinky. </p>\n<p><img src=\"/build-guide-plus/Plinky_Patch_Editor_2.png\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<h2 id=\"installing-a-battery-pack\">Installing a Battery Pack</h2>\n<p>While Plinky+ does not come with a built-in battery, it has the circuitry and a connector that lets you retrofit a battery pack.</p>\n<blockquote>\n<p>You are retrofitting a Lithium-Ion Battery Pack at your own risk. As with all Lithium-ion polymer batteries, only proceed if you are comfortable and experienced working with power supplies.</p>\n</blockquote>\n<p>Plinky+ can be powered from a 3.7V rechargeable Lithium Ion Battery Pack, with up to four 18650 cells.\nThe Battery Pack needs to come with its own charge protection circuit, and a 2.54mm JST connector to plug into the main board.</p>\n<p>Before you disassemble anything, make sure your Plinky+ is switched off and remove any and all cable connections including Audio and USB cables.</p>\n<h3 id=\"remove-the-faceplate\">Remove the faceplate</h3>\n<p>First, you need to remove Plinky+&#39;s faceplate.</p>\n<ol>\n<li>   Remove the knob caps by pulling them off</li>\n<li>   Unscrew the 4 black hex nuts from the Encoder and Potentiometers</li>\n<li>   Unscrew the 9 black screws holding down the front panel with an M3 Phillips screwdriver</li>\n</ol>\n<p>Now you can remove the front panel by carefully lifting it upwards toward you.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0107.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>An extra PCB panel with printed safety instructions covers four welded studs that forms a cavity for a Battery Pack. Remove the four screws and lift it up.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0085a.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<h3 id=\"connect-the-battery-pack\">Connect the Battery Pack</h3>\n<p>Make sure you are electrostatically discharged before you handle the PCB and Electronics. The SMD components are delicate. Handle carefully.</p>\n<p>The space between the four screw posts fits a standard 3.7V rechargeable Lithium Ion Battery Pack with four 18650 cells. Place the battery in the space below the mainboard and connect the battery to the 2.45 mm pinheader on the bottom left of the mainboard.</p>\n<p>The connector on the PCB is marked Rechargeable Battery – 3.7V Lithium Ion pack with charge protection. A Polarity Warning is printed next to the pinheader.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0088.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Connect the Battery. Make sure you get the polarity right: looking at the mainboard at the side with the  print labels right side up, the negative terminal sits on the left side, the positive terminal on the right.</p>\n<p>Various brands may mark polarity differently – most have a red and black cable, but what that means in terms of polarity may vary. Always check with the datasheet of your Battery Pack that the polarity is indeed correct, and matches the print on the PCB.</p>\n<blockquote>\n<p>The LED on the board acts as a polarity test. If the LED on the main board lights up, the polarity of the Battery Pack is incorrect. In this case, disconnect the Battery&#39;s cable and reverse the polarity!</p>\n</blockquote>\n<p>Reinstall the Battery cover using the four black M3 screws.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0093.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Now, test whether Plinky+ powers up by pressing the on/off button. Once Plinky+ boots and has started up as expected, with the Plinky logo on its screen, power it off.</p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0095.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\">\n<img src=\"/build-guide-plus/Plinky+_Build-Guide_0096.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p>Reinstall the front panel with its screw and hex nuts. Push the four knob caps back on.\nProvided the Battery is charged, your Plinky+ is now ready to run on either Battery or USB.</p>\n<p>If you are looking for detailed instructions on how to install the front panel or need to yet finish your build, please continue <a onclick=\"document.location.hash='place-front-panel';\" href=\"javascript:;\">here</a>.</p>\n<h3 id=\"charging-via-usb\">Charging via USB</h3>\n<p>You can use the USB-C port to charge the Battery with a 1A rate. </p>\n<p>Plinky+ draws about 400 mA from a 5V supply. Due to the relatively large capacity of common Lithium Ion Battery Packs, you may be able to use Plinky+ for a long time on a single full charge – we tested up to 8 hours in one go, with a four cell Battery Pack.</p>\n<p>But a large capacity for the Battery also means a full charge may take a long time. At a 1A rate, a full charge may take around 11 hours. </p>\n<p>The USB window will glow red while the Battery is charging, and switches to blue once fully charged.</p>\n<h3 id=\"charge-rate\">Charge Rate</h3>\n<p>When charging Lithium batteries, it&#39;s important to keep track of the charge rate. A rule of thumb is, you should max charge at 1C of current. For a 9000mAh Battery Pack, it&#39;s 9000mA. Plinky+ charges at a 1000mA rate. This means you cannot use a Battery smaller than 1000mAh.</p>\n<p>You can estimate how long it takes to charge a battery by taking the capacity, dividing by the rate, and multiplying by 125%. </p>\n<p>For example, a 9000mAh battery charging at 1000mA takes 9000/1000 * 125% = 11 Hours. Less if the Battery is not fully drained!</p>\n<h3 id=\"additional-safety-notes\">Additional Safety Notes</h3>\n<p>Do not abuse these types of Battery Packs, do not short, bend, crush, or puncture. Never charge or use them unattended. </p>\n<p>While installing, inspect the Battery and surrounding circuitry for any signs of damage, loose wiring, or the possibility of short circuits.</p>\n<p>Various brands may mark polarity differently –always check the polarity is correct. Reverse polarity can destroy your battery.</p>\n<p>Only purchase Battery Packs from sources you trust. If the Battery Pack looks defective, punctured or otherwise broken, discard it responsibly and according to applicable laws.</p>\n<p>As with all Lithium-ion polymer batteries, and power supplies in general, only proceed with their installation if you are comfortable and experienced working with power supplies. </p>\n<p>If in doubt, ask an expert for help, or contact us on the Plinky Discord.</p>\n<h2 id=\"firmware\">Firmware</h2>\n<p>Plinky+ ships with firmware 0.B2 or higher. </p>\n<h3 id=\"install-firmware\">Install firmware</h3>\n<p>Here are the steps required to update your firmware to the latest build:</p>\n<ul>\n<li>Download the latest .UF2 file from the <a target=\"_blank\" rel=\"nofollow\" href=\"https://plinkysynth.com/firmware/\">Firmware</a> page.</li>\n<li>With Plinky+ powered off, connect Plinky+ to a power source (PC or Mac USB port, or USB power adapter)</li>\n<li>Hold down the Encoder, and with it held down, press the on/off button to turn Plinky+ on</li>\n<li>The screen remains blank, and you’ll see a tunnel of flashing LEDs</li>\n<li>Plinky should show up on your PC as a USB Drive</li>\n<li>Drag and drop the UF2 file onto the Plinky USB Drive</li>\n</ul>\n<div class=\"two\">\n\n<p><img src=\"/build-guide-plus/Plinky+_Build-Guide_0142.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n<p><img src=\"/build-guide-plus/Plinky+_Build-FW_Update.jpg\" alt=\"Plinky+ DIY Kit – Build Guide\"></p>\n</div>\n\n\n<h1 id=\"safety-instructions\">Safety Instructions</h1>\n<p>In Compliance with GPSR EU Regulation 2023/988, find the Safety Instructions <a target=\"_blank\" rel=\"nofollow\" href=\"../docs/safety\">here</a>.</p>\n","date":"2024-03-21T16:36:00.000Z","excerpt":"","printDate":"March 21, 2024","toc":[{"anchor":"some-tools-you-will-need","level":3,"text":"Some tools you will need"},{"anchor":"here-s-what-you-will-find-in-the-kit","level":3,"text":"Here’s what you will find in the kit"},{"anchor":"build-guide","level":2,"text":"Build Guide"},{"anchor":"attach-the-back-panel","level":3,"text":"Attach the back panel"},{"anchor":"assemble-mainboard-and-jacks","level":3,"text":"Assemble Mainboard and Jacks"},{"anchor":"place-mainboard-in-metal-enclosure","level":3,"text":"Place mainboard in metal enclosure"},{"anchor":"place-the-knurled-nuts","level":3,"text":"Place the knurled nuts"},{"anchor":"place-the-oled-board","level":3,"text":"Place the OLED board"},{"anchor":"first-power-up","level":3,"text":"First power up"},{"anchor":"place-the-front-panel","level":3,"text":"Place the Front Panel"},{"anchor":"screw-down-the-front-panel","level":3,"text":"Screw down the front panel"},{"anchor":"congratulations-your-build-is-done-","level":3,"text":"Congratulations, your build is done!"},{"anchor":"power-up-your-plinky-and-calibration","level":3,"text":"Power up your Plinky+ and Calibration"},{"anchor":"touch-calibration","level":3,"text":"Touch calibration"},{"anchor":"put-on-the-knob-caps","level":3,"text":"Put on the Knob Caps"},{"anchor":"happy-plinking","level":3,"text":"Happy Plinking"},{"anchor":"installing-a-battery-pack","level":2,"text":"Installing a Battery Pack"},{"anchor":"remove-the-faceplate","level":3,"text":"Remove the faceplate"},{"anchor":"connect-the-battery-pack","level":3,"text":"Connect the Battery Pack"},{"anchor":"charging-via-usb","level":3,"text":"Charging via USB"},{"anchor":"charge-rate","level":3,"text":"Charge Rate"},{"anchor":"additional-safety-notes","level":3,"text":"Additional Safety Notes"},{"anchor":"firmware","level":2,"text":"Firmware"},{"anchor":"install-firmware","level":3,"text":"Install firmware"},{"anchor":"safety-instructions","level":1,"text":"Safety Instructions"}]}