{"title":"Blueberry build guide - V1","slug":"build-guide_blueberry","html":"<p>Hello! Welcome to the Blueberry build  guide.\nBuzzy is quite a simple build, and fairly beginner friendly. </p>\n<img src=\"/blueberryspin.gif\">\n\n<p><strong>You will need:</strong> a soldering iron, a Blueberry kit, and a little patience.</p>\n<p>Below are most of the parts of the Blueberry kit, with the exception of the Eurorack power cable and  mounting hardware.</p>\n<p><img src=\"/blueberry-build-guide/IMG_7215.jpeg\" alt=\"Parts\"></p>\n<h2 id=\"the-smd-headers-a-nice-warmup\">The SMD headers - a nice warmup</h2>\n<p>Let&#39;s get the two &#39;SMD&#39; headers out of the way - one is the small 6 pin socket for the front panel, the other is a chunky 2x5 eurorack power header.</p>\n<p>Put a small pillow of solder on a <em>single</em> pin on each of the SMD footprints. You don&#39;t need much solder - just enough to cover the pad.</p>\n<p float=\"left\">\n  <img src=\"/blueberry-build-guide/IMG_7234.jpeg\" width=\"47%\" />\n  <img src=\"/blueberry-build-guide/IMG_7237.jpeg\" width=\"40%\" />\n</p>\n\n<p>now line up each socket and use your iron to heat up the pollow and solder that first pin. It&#39;s worth getting the socket nice and straight, centered, and upright while only 1 pin is soldered. Don&#39;t bend it! just touch your iron to re-heat the pillow and gently move the socket into place while the solder is melted. Once you&#39;re happy with the alignment, solder the rest of the pins. be sure to heat both pad and pin, so that the solder flows nicely onto both. The power header pins can take quite a bit of heat - let them warm up before flowing a small amount of solder. Here it is, soldered. </p>\n<p float=\"left\">\n  <img src=\"/blueberry-build-guide/IMG_7235.jpeg\" width=\"42%\" />\n  <img src=\"/blueberry-build-guide/IMG_7238.jpeg\" width=\"45%\" />\n</p>\n\n<p>That&#39;s the fiddly bit out the way!</p>\n<h2 id=\"placing-the-hardware-but-not-soldering-it-\">Placing the hardware (but not soldering it)</h2>\n<p>OK Now we&#39;re ready to put the 6 sockets into Blueberry! Don&#39;t forget the little 6 pin strip - as shown below. <strong>DONT SOLDER ANYTHING YET!</strong> Just plop &#39;em in place. The stereo pairs of thonkiconns actually share a single hole for the &#39;ground&#39; pins, so it can be a bit fiddly, but you can do it! I believe in you!</p>\n<p><img src=\"/blueberry-build-guide/IMG_7239.jpeg\" alt=\"Loose parts\"></p>\n<p>Why not solder them? You&#39;ll see! Now is the exciting moment we get to place the front panel over the top of everything. The thonkis and two delicate switches should all go through the holes, perhaps after a little wiggling and persuasion (good thing you didn&#39;t solder them right!). The 6 pin header and the socket you soldered earlier should mesh together beautifully inside the sandwich. This can be the fiddliest bit - don&#39;t force it, or you may rip the socket off the front panel! I found a trick is to take the 6 pins out of the main board, and put them into the socket, but super loosely, like this:</p>\n<p><img src=\"/blueberry-build-guide/IMG_7240.jpeg\" alt=\"Loose pins\"></p>\n<p>That way, the pins &#39;dock&#39; into the main board first, then the thonkis, and you can wriggle everything into place.</p>\n<p>Take a moment to marvel at your achievement! Double check all the unsoldered pins came through ok, and then, screw the nuts on top of the panel to the thonkis - it&#39;s really starting to look like a music thing now! </p>\n<p><img src=\"/blueberry-build-guide/IMG_7216.jpeg\" alt=\"Top view\"></p>\n<h2 id=\"ok-now-you-can-solder-the-hardware\">OK, NOW you can solder the hardware</h2>\n<p>At this point you should solder all of the pins poking through the bottom of the board. Don&#39;t forget any! Especially the 6 pin header. I&#39;ve marked every solder point with a yellow arrow in the image below. Just 21 - not that many! <strong>Be careful to avoid melting or disturbing the tiny pre-soldered parts</strong>.</p>\n<p><img src=\"/blueberry-build-guide/IMG_7243.jpeg\" alt=\"Not Kittens\"></p>\n<h2 id=\"hardware-victory\">Hardware Victory</h2>\n<p>My goodness! That was it! Double check you got <em>all</em> the solder joints above - are you SURE you got the 6 touch pins? ALL the thonkis? SURE? SURE? OK! - </p>\n<p>All that remains is to tighten the nuts, and perhaps upgrade the software!</p>\n<h2 id=\"the-software-adventure\">The Software Adventure</h2>\n<p>Your Blueberry kit should come pre-flashed with firmware, so in theory it should just work straight away without any further ado. If you want, go and read the <a href=\"docs/blueberry-manual\">manual</a>.</p>\n<p>However, if you wish to update Blueberry, read on.</p>\n<p>First, download the firmware in this file: <a href=\"blueberry-firmware/blueberry_001.uf2\"><code>blueberry_001.uf2</code></a>. Patch notes are available on the manual page.</p>\n<p>Use a USB-C cable (not included) to plug your computer into Blueberry. You do <strong>not</strong> need Blueberry to be powered from eurorack for this step. </p>\n<p>Blueberry should show up as a USB drive called <code>RPI-RP2</code> (on mac, you may find it under <code>/Volumes/RPI-RP2</code>). If it does not, try disconnecting the USB cable, holding down the <em>tiny</em> button on the main board, just next to the USB connector (hilighted below), while reconnecting the cable - then release the button. If it <em>still</em> doesn&#39;t show up, make sure your cable has data lines (and isn&#39;t just for charging). And if that&#39;s definitely ok - maybe check your soldering?</p>\n<p><img src=\"/blueberry-build-guide/IMG_7255_2.jpeg\" alt=\"Boot0\"></p>\n<p>Assuming the drive shows up, drag and drop the <code>blueberry_xxx.uf2</code> (where xxx is a version number) onto the drive. It should upload the software. </p>\n<p>Assuming all seems well, disconnect it from your PC, carefully connect it to your eurorack system (the power cable can be fitted either way), and -  <em>Happy blueberry-ing</em>!</p>\n<p><strong>Note! you will want to calibrate the CV outputs of blueberry.</strong> This is really easy - it just takes two patch cables once you have plugged blueberry into your eurorack system. Find out more in the <a href=\"docs/blueberry-manual\">manual</a>.</p>\n","date":"2024-10-28T21:50:00.000Z","excerpt":"","printDate":"October 28, 2024","toc":[{"anchor":"the-smd-headers-a-nice-warmup","level":2,"text":"The SMD headers - a nice warmup"},{"anchor":"placing-the-hardware-but-not-soldering-it-","level":2,"text":"Placing the hardware (but not soldering it)"},{"anchor":"ok-now-you-can-solder-the-hardware","level":2,"text":"OK, NOW you can solder the hardware"},{"anchor":"hardware-victory","level":2,"text":"Hardware Victory"},{"anchor":"the-software-adventure","level":2,"text":"The Software Adventure"}]}