{"title":"Plinky build guide - V3 Black (new)","slug":"build-guide-black","html":"<p>This is the build guide for the Plinky V3 kit from Thonk. It&#39;s easy to identify:</p>\n<ul>\n<li>black mainboard</li>\n<li>four stereo jacks at the bottom</li>\n<li>a single-line socket for the OLED screen at the top</li>\n</ul>\n<p>Check out the old build guides if your Plinky has a <a href=\"/docs/build-guide\">green</a> or <a href=\"/docs/build-guide-blue\">blue</a> mainboard.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2654.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Thank you for getting a Plinky kit. It is an easy DIY build suited for beginners and comes with many of the critical electronics pre-assembled. However, it does require very careful and precise soldering.</p>\n<p>If this is your first time soldering, please read the <a target=\"_blank\" rel=\"nofollow\" href=\"https://learn.adafruit.com/adafruit-guide-excellent-soldering/\">Adafruit Guide to Excellent Soldering</a> first.</p>\n<h3 id=\"undefinedsome-tools-you-will-need\">Some tools you will need</h3>\n<p><img src=\"/build-guide-black/Build-Guide_1616.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<ul>\n<li>A spool of solder. We use lead free 0.5mm.</li>\n<li>A soldering iron for electronics. A good temperature for soldering lead free solder is 375 - 380° C.</li>\n<li>Snipe-nose pliers</li>\n<li>A Multimeter</li>\n</ul>\n<h3 id=\"undefinedhere-s-what-you-will-find-in-the-kit\">Here’s what you will find in the kit</h3>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2501.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<ul>\n<li>The front panel</li>\n</ul>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2507.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<ul>\n<li>The main board with presoldered components</li>\n</ul>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2505.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<ul>\n<li>The back panel</li>\n</ul>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2630a.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<div class=\"three\">\n<div>\n\n<ul>\n<li>Eurorack power cable</li>\n<li>OLED screen</li>\n<li>Green spacer PCB</li>\n<li>2x 2x8 angled header</li>\n<li>4x black hex standoffs</li>\n<li>8x black M3 screws</li>\n</ul>\n</div>\n<div>\n\n<ul>\n<li>1x encoder + silver nut</li>\n<li>2x potentiometers B10k</li>\n<li>3x black hex nuts</li>\n<li>1x encoder cap</li>\n<li>2x potentiometer caps with indicator</li>\n</ul>\n</div>\n<div>\n\n<ul>\n<li>13x black Thonkiconn</li>\n<li>3x green Thonkiconn</li>\n<li>16x knurled nuts</li>\n<li>4x rubber feet</li>\n<li>Quickstart Guide</li>\n</ul>\n</div>\n</div>\n\n<h2 id=\"undefinedbuild-guide\">Build Guide</h2>\n<p>All of the SMD components on the PCB have already been assembled for you, so this is a very quick build. However, it does require very careful and precise soldering. </p>\n<p>Avoid touching the SMD components with your hands and be very careful not to touch them with your soldering iron. Take your time, and use an iron with a reasonably small tip.</p>\n<h3 id=\"undefinedremove-the-assembly-rails\">Remove the assembly rails</h3>\n<p>Your main board will come with 5mm rails at the top and bottom of the board. They are pre-scored to make them easy to remove. Hold the edge of the PCB in one hand, and use Snipe-nose pliers to pinch alongside the rail with your other. Gently bend the rail with the pliers until the rail snaps off.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2651.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p><em>Snap off the 5mm rails at the top and bottom of the board.</em></p>\n<h3 id=\"undefined2x8-header\">2x8 Header</h3>\n<p>Turn the PCB over, so that the surface-mount components are facing up - this will be the front-facing side of Plinky. This side has the word ‘guts’ printed on it.</p>\n<p>Start by placing the two 2x8 angled headers. The eurorack power connector goes into the board where it says ‘europe’. An identical part goes into the footprint for the expander that says ‘window to the world’.</p>\n<p>The expander is an optional open-source 4HP Eurorack add-on to Plinky. Its most important feature, TRS Midi I/O, has been integrated into the design of Plinky V3 and can be found at the bottom of the main board. In addition to that, the expander provides front-panel access to USB and 4 CV sockets. Do not plug Euro power into the expander socket, it&#39;s for the expander only!</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2513.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Make sure that the connectors sit on the correct side: the black plastic box should lay flush on the side that holds the SMD components. The short pins stick through the PCB and should be soldered on the bottom side. </p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2733.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Use a piece of masking tape to keep the headers in place, then flip the board over. </p>\n<p>Using a fine soldering tip, solder one corner pin on each side first. Check that the pin header sits flush and reheat to adjust if necessary. Once the pin header sits flush, finish the two rows of pins on each header.</p>\n<h2 id=\"undefinedpotentiometers-jacks-and-screen\">Potentiometers, Jacks and Screen</h2>\n<p>Next, orient the PCB so you can see the side with the SMD components. \nPlace all the components onto the board, but do not solder anything yet.</p>\n<p>The groups of rectangular outlines marked with J and a number indicate where to place the Thonkiconn jacks.</p>\n<h3 id=\"undefinedplace-green-thonkiconn\">Place Green Thonkiconn</h3>\n<p>Place the three green Thonkiconn first. They go on the left hand side of the board, into the footprints marked GREEN!, and fill the second, third and last position from the top. <strong>Place but do not solder yet.</strong></p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2515.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<h3 id=\"undefinedplace-black-thonkiconn\">Place Black Thonkiconn</h3>\n<p>Fill the rest of the spots with black Thonkiconn, on the left and right hand side of the board. <strong>Place but do not solder yet.</strong></p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2517.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<h3 id=\"undefinedplace-potentiometers-and-encoder\">Place Potentiometers and Encoder</h3>\n<p>Place the two potentiometers into the footprints marked ‘pot’ and ‘kettle’. Both potentiometers have three legs on one side and are marked B10k. <strong>Place but do not solder yet.</strong></p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2523.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>The encoder has a flatter housing than the potentiometers. You will find a hex nut in the kit. Screw it onto the encoder to offset the difference in height. Then place the encoder in the footprint that says ‘ink’.</p>\n<div class=\"two\">\n\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2678.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2784.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n</div>\n\n<p>With both the potentiometers and encoder, you may need to squidge the side brackets a little to make them fit. Be gentle as the pins may bend easily if you don’t line them up with the holes. Inspect to make sure all legs stick through the PCB, and the parts sit straight on top of the board.</p>\n<h3 id=\"undefinedplace-the-oled-screen\">Place the OLED screen</h3>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2720.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>The OLED screen comes on a small blue PCB with the four-pin header presoldered. </p>\n<p>In order to make it sit at the correct height, you need to carefully remove the black plastic from the legs with tweezers or pliers. </p>\n<p>The screen is delicate. The OLED and glass is glued on, so the right way to hold it is at the blue PCB. </p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2701.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Make sure not scratch the glass surface.</p>\n<p>Slide on the little green spacer PCB, so it sits under the blue PCB. The little white arrow is printed on the top side of the board, and points towards the SDA pin. </p>\n<p>This PCB is to ensure no components on the underside of the OLED module accidentally make contact with the audio jacks.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2718.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Gently slot the OLED into the single row socket - it should not require any force to do so. </p>\n<p>Once placed correctly, the glass part should sit at the same height as the Thonkiconn and potentiometers. </p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2537.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Unlike on previous versions of Plinky, you do do not need to solder anything on the OLED screen. As it is held in place with a socket, it is also relatively easy to replace should it ever scratch or break.</p>\n<p>The screen comes with the kind of protective film that prevents electronic devices from truly being your own. Now is the time to remove the protective film from the screen.</p>\n<h3 id=\"undefinedplace-panel-thonkiconn-nuts\">Place Panel + Thonkiconn Nuts</h3>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2544.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Once all the components are in place, but not soldered yet, make sure everything lines up and put on the front panel. </p>\n<p>The front panel has two grey 2x8 sockets on its underside, which line up exactly with the two 2x8 pin headers on the main board.</p>\n<p>Align the sockets and headers so that they match, and gently push the front panel onto the main board. If done correctly, the Thonkiconn jacks align with the holes so that their metal threads sticks through the panel.</p>\n<p>Check that the screen sits right and is pushed down into its socket. The panel should sit flat and not flex. You can adjust your screen with tweezers to have it properly aligned with the panel cutout.</p>\n<p>Screw on the knurled Thonkiconn nuts and the black hex nuts for potentiometers and encoder, so the panel sits tightly atop the jacks and pots, and the jacks sit flush on the PCB.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2549.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<h3 id=\"undefinedsolder-thonkiconn-and-potentiometers\">Solder Thonkiconn and Potentiometers</h3>\n<p>Before you solder, make sure everything is as tightly sandwiched as possible. Solder the jacks first, so the whole arrangement holds together.\nCheck one last time everything sits right, then solder the potentiometer and encoder legs on the back.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2554.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<h3 id=\"undefinedsecure-the-usb-ports\">Secure the USB Ports</h3>\n<p>Solder the through-hole part of the two USB connectors, on the bottom side of the board, between the top and bottom audio jacks. Plinky comes with the USB ports pre-mounted on the top side, and you can reinforce them by soldering from the bottom to secure them firmly to the board. They don’t need a massive amount of solder - just fill up the little holes with a little bit of solder.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2737.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<h3 id=\"undefinedassemble-the-case\">Assemble the case</h3>\n<p>Use the four M3x15mm hex spacers, along with the 8 included M3 screws, to hold Plinky together in a nice pocket operator-style open case. </p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2692.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>First, screw the spacers into the base plate using the M3 screws and a Philips screwdriver.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2562.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Then, place the back plate with the standoffs and screw Plinky into them from above.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2575.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<h3 id=\"undefinedcongratulations-your-build-is-done-\">Congratulations, your build is done!</h3>\n<p>The hardware part is done. Take a moment to appreciate the majesty of your crafting skills.</p>\n<p>Now is a good time to stick the 4 included rubber feet to the back plate. \nThey are self-adhesive. Peel them off the wax paper and place them in the four corners of Plinky&#39;s back plate, next to the four screws, if you are worried about scratching the surfaces Plinky sits on.</p>\n<p>Only once you’ve tested the functionality of your module, put on the aluminium knob caps.</p>\n<h3 id=\"undefinedpower-up-your-plinky\">Power up your Plinky</h3>\n<p>There are three ways to power up your Plinky. Only use one at a time.</p>\n<ul>\n<li>with a USB cable connected to the top port</li>\n<li><strong>or</strong> with a USB cable connected to the bottom port</li>\n<li><strong>or</strong> using the Europower cable and the Europower header marked Europe</li>\n</ul>\n<p>If Plinky shows no sign of powering on at all, power down, and check your soldering carefully for shorts.\nIf it still does nothing, it may be a software issue - work through the Firmware section below, then the Troubleshooting Appendix.</p>\n<h2 id=\"undefinedcalibration\">Calibration</h2>\n<p>Plinky will go into touch calibration mode the first time it boots, or after you finish flashing it with the latest firmware. \nCalibration mode is indicated on the display, and the bottom row of LEDs light up. You can watch the calibration process in this <a target=\"_blank\" rel=\"nofollow\" href=\"https://youtu.be/M9FH82lPIkM?t=2852\">video</a>.</p>\n<h3 id=\"undefinedtouch-calibration\">Touch calibration</h3>\n<p>In calibration mode, one LED in each column will be lit. Press your finger evenly and as centrally as possible on one of the lit pads, medium hard (mezzo-forte) for a few seconds. After a few seconds, the LED will start blinking and you can release. </p>\n<p>Plinky will ask you to do this for all 72 pads, by lighting them in turn.</p>\n<p>If you aren’t quite central with your finger, don’t release - just slide your finger into place with it held down, and keep it held down a few seconds once it’s central. \nIf you completely mess up, switch Plinky off and on again, and try again.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2609.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Once you’ve finished, your Plinky is ready to play!</p>\n<p>You may need to recalibrate Plinky</p>\n<ul>\n<li>if you place Plinky in a new case</li>\n<li>if you power Plinky from Eurorack</li>\n<li>if it is responding offset to your finger presses</li>\n<li>if you buy a previously owned Plinky</li>\n</ul>\n<p>Twist the leftmost knob as Plinky powers up, then follow the steps described above.</p>\n<p>Calibration will tell you if it finds a short or ‘no connection’ in your pin headers. If this happens, the screen will go white and tell you on which column there is a problem. \nKeep going with calibration, but take a note of which columns are problematic (counting 1 - 8 from left to right). Then consult the troubleshooting appendix below for help.</p>\n<h3 id=\"undefinedhappy-plinking\">Happy Plinking</h3>\n<p>Congratulations, it is done! Happy Plinking!</p>\n<p>Please check out the <a target=\"_blank\" rel=\"nofollow\" href=\"https://plinkysynth.com/docs/play-guide\">Play Guide</a> and the <a target=\"_blank\" rel=\"nofollow\" href=\"https://plinkysynth.com/docs/manual\">Manual</a>.</p>\n<p>Plinky also has a a browser-based patch editor at <a target=\"_blank\" rel=\"nofollow\" href=\"https://plinkysynth.github.io/editor/\">plinkysynth.github.io/editor</a>.\nYou will need a Web-Serial enabled browser like Google Chrome to run it, and allow it to connect with Plinky. \nOn Linux, you will need to <a onclick=\"document.location.hash='undefinedbrowser-based-patch-editor-linux-';\" href=\"javascript:;\">grant hardware access</a> to Plinky. </p>\n<p><img src=\"/build-guide-black/Plinky_Patch_Editor_2.png\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<h2 id=\"undefinedfirmware\">Firmware</h2>\n<p>Plinky V3 ships with firmware 0.9z or higher. </p>\n<h3 id=\"undefinedinstall-firmware\">Install firmware</h3>\n<p>Here are the steps required to update your firmware to the latest build:</p>\n<ul>\n<li>Download the latest .UF2 file from the <a target=\"_blank\" rel=\"nofollow\" href=\"https://plinkysynth.com/firmware/\">Firmware</a> page.</li>\n<li>With Plinky powered off, hold down the encoder (the rightmost knob)</li>\n<li>While still held down, connect Plinky to a PC or Mac USB port</li>\n<li>The screen remains blank, and you’ll see a tunnel of flashing LEDs</li>\n<li>Plinky should show up on your PC as a USB Drive</li>\n<li>Drag and drop the UF2 file onto the Plinky USB Drive</li>\n<li>The blinking LEDs will change to a flashing pattern</li>\n<li>Once that is done, press the encoder once to reset Plinky</li>\n</ul>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_2610.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p><img src=\"/build-guide-black/Plinky_Build-FW_Update.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>If you run into trouble with updating your build, here are some things you can check:</p>\n<ul>\n<li>If Plinky shows no sign of powering on at all, unplug and check for shorts or bad joints.</li>\n<li>Check that every light is working. If not, you may need to touch up your soldering.</li>\n<li>If you see the tunnel of LEDs, but no USB drive, make sure you use a USB-C cable that you can use to transfer data with.</li>\n<li>Mac M1 / M2 users with OS 14 have reported issues connecting in bootloader mode. Check with another machine to make sure Plinky is working correctly</li>\n</ul>\n<p>You can see the update process in this <a target=\"_blank\" rel=\"nofollow\" href=\"https://youtu.be/M9FH82lPIkM?t=2759\">video</a>, at the 46 minute mark. </p>\n<h3 id=\"undefinedinstall-firmware-linux-\">Install firmware (Linux)</h3>\n<p>Here are the steps required to update your firmware to the latest build under Linux. This was tested on Raspberry Pi 4 running Raspian.</p>\n<p>Download the latest .bin file from the <a target=\"_blank\" rel=\"nofollow\" href=\"https://github.com/plinkysynth/plinky_public\">GitHub Repository</a> page. To do this from the command line, open a terminal and enter</p>\n<pre class=\"language-\"><code class=\"language-\">wget https://plinkysynth.com/firmware/stable/CURRENT.uf2</code></pre><ul>\n<li>With Plinky powered off, hold down the encoder (the rightmost knob)</li>\n<li>While still held down, connect Plinky to a PC or Mac USB port</li>\n<li>The screen remains blank, and you’ll see a tunnel of flashing LEDs</li>\n<li>Mount Plinky as USB Drive from the terminal:</li>\n</ul>\n<pre class=\"language-\"><code class=\"language-\">sudo mkdir /mnt/plinky \nsudo mount /dev/sda /mnt/plinky\nls /mnt/plinky</code></pre><p>You should see the content of Plinky listed as follows:</p>\n<pre class=\"language-\"><code class=\"language-\">BOOTLOAD.UF2  CURRENT.UF2  INFO_UF2.TXT  SAMPLE0.UF2  SAMPLE2.UF2  SAMPLE4.UF2  SAMPLE6.UF2 \n CALIB.UF2     INDEX.HTM    PRESETS.UF2   SAMPLE1.UF2  SAMPLE3.UF2  SAMPLE5.UF2  SAMPLE7.UF2</code></pre><p>Copy the firmware to Plinky.</p>\n<pre class=\"language-\"><code class=\"language-\">sudo cp -f CURRENT.uf2 /mnt/plinky/</code></pre><p>The blinking LEDs will change to a flashing pattern. Once that is done, press the encoder once to reset Plinky.</p>\n<h3 id=\"undefinedbrowser-based-patch-editor-linux-\">Browser-based patch editor (Linux)</h3>\n<p>When trying to connect to the <a target=\"_blank\" rel=\"nofollow\" href=\"https://plinkysynth.github.io/editor/\">browser-based patch editor</a> using Linux, if you get a message like </p>\n<pre class=\"language-\"><code class=\"language-\">SecurityError: Failed to execute 'open' on 'USBDevice': Access denied. </code></pre><p>you may need to grant hardware access to Plinky. This can be done by adding an udev rule.</p>\n<p>First, ensure that the Plinky is connected to your computer via USB. \n</br>You can check if the Plinky is connected by running:</p>\n<pre class=\"language-\"><code class=\"language-\">lsusb</code></pre><p>You should see a line similar to:</p>\n<pre class=\"language-\"><code class=\"language-\">Bus 001 Device 026: ID cafe:4018 Plinky PlinkySynth MIDI</code></pre><p>Note the cafe id. If this is not showing up, you may need to check your USB cable.</p>\n<p>Next, add yourself to the plugdev group. You can do this by running:</p>\n<pre class=\"language-\"><code class=\"language-\">sudo usermod -a -G plugdev $USER</code></pre><p>You will need to log out and log back in for the group membership to take effect. \n</br>To check if you are in the plugdev group, you can run:</p>\n<pre class=\"language-\"><code class=\"language-\">groups</code></pre><p>This should show a list of groups you are in, and plugdev should be one of them.</p>\n<p>Next, you need to create a udev rule to allow access to the Plinky. \n</br>You can use nano or any other editor of your choice:</p>\n<pre class=\"language-\"><code class=\"language-\">sudo nano /etc/udev/rules.d/99-plinky.rules</code></pre><p>The file should have the following line:</p>\n<pre class=\"language-\"><code class=\"language-\">SUBSYSTEM==\"usb\", ATTRS{idVendor}==\"cafe\", MODE=\"0660\", GROUP=\"plugdev\"</code></pre><p>This grants read access to the Plinky to the plugdev group.</p>\n<p>Then, reload the udev rules:</p>\n<pre class=\"language-\"><code class=\"language-\">sudo udevadm control --reload-rules</code></pre><p>Finally, unplug and replug the Plinky, and you should be able to connect to the editor.\n</br>Thank you to users ddmm64 and ch-one for submitting this solution.</p>\n<h2 id=\"undefinedtroubleshooting-appendix\">Troubleshooting Appendix</h2>\n<p>If you bought your board from Thonk, we tested your mainboard and calibrated the CV I/O. We also tested the front panel for defective LEDs. </p>\n<p>If you experience problems with Plinky having unlit or stuck LEDs, or not registering touch correctly, please check the Appendix below.</p>\n<h3 id=\"undefinedcommon-hardware-issues\">Common hardware issues</h3>\n<p>So, your Plinky booted up. You probably managed to put new firmware on it, even calibrate it, but during calibration it complained about some of the pads, or now that it’s running, you’ve noticed some LEDs are out or the touch is behaving weird. Don’t worry! These are the most common problems, and they’re easy to fix.</p>\n<p>Here are some common problems</p>\n<p><strong>Q: I can&#39;t get Plinky into flashing mode by pressing down the encoder while plugging in the USB cable.</strong></p>\n<p><strong>A:</strong>  This is the most common question - check that the encoder can actually click! The knobs you received can be of varying height due to manufacturing tolerances, and the encoder needs a little bit of room to click down. You might have to put a tiny paper ball under the knob if you soldered the encoder a little low- this will help keep the knob up and make the encoder click.</p>\n<p><strong>Q:  Plinky always boots either to ‘calibration’ or play mode, but I can’t get it to boot into the USB update mode (by holding down the encoder on boot)</strong></p>\n<p><strong>A:</strong>  check the solder joints around the encoder. Reflow them, and try again. Be sure to hold the encoder firmly down as you power Plinky up.</p>\n<p><strong>Q: Plinky doesnt show up on my PC as USB device when I boot in ‘update mode’. I can see the tunnel of lights, but no USB device shows up.</strong></p>\n<p><strong>A:</strong>  Check your cable. It’s always the cable. Unfortunately, USB cables are a mess. Many are ‘power only’. Plinky needs a cable with 4 wires in it, to carry data. It should be a cable that you can use to transfer data with your phone or other device, for example. Typically, they are slightly fatter and less flexible than the really cheap ‘charging only’ cables. A few people reported raiding their cable boxes for 4 or 5 cables before they found a data cable! Playstation 4 controllers don&#39;t use data - they always use bluetooth, even when plugged in. So many playstation controller cables are charging only, and are thus no good.</p>\n<p><strong>Q: A whole row of LEDs is unlit.</strong></p>\n<p><strong>A:</strong>  Don’t panic! If it&#39;s the blue row at the bottom, it may be that you&#39;ve tightened the bottom right hex nut tightly and it&#39;s ended up crushing a hidden trace and shorting it out. If loosening that hex nut fixes it, then either leave it loose or paint it with varnish to insulate it.</p>\n<p>If that nut doesn&#39;t fix it, or it&#39;s another row, you’ve just got a single dodgy joint on one of the pins of the connectors that go between the front and back panel. </p>\n<p>Looking at Plinky with xray eyes from the top (as if you’re playing it), there are two sets of 8x2 pins - one top left, the other top right. The LEDs are on the top right header. The rows of LEDs are controlled by the 8 pins that are on the ‘bottom’ row, as you look at it from above. </p>\n<p>In other words, the 8 pins further from the top of the board, on the right side connector. The first pin on the left is the first row of leds. Each pin to the right corresponds to a row of LEDs going down the panel. So if the 6th row down of LEDs is out, you have a dodgy joint on the 6th pin from the left, on the bottom row, of the right connector. </p>\n<p>Go check the pins on the back of the mainboard. Check if the socket itself is not damaged. </p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_Header.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p><em>This is the pinout of the right connector for reference.</em></p>\n<p>The first 5 pins at the top correspond to columns of LEDs. The top right 2 pins, marked TS2_ and TS1_, correspond to the touch strip (not LEDs) horizontally at the bottom of Plinky. And the bottom 8 pins, from left to right, correspond to the white LED rows, from top to bottom, as described in the paragraph above.</p>\n<p>Bottom line: Row of LED’s out? Check your lower pins on the right connector, and/or try loosening the bottom right nut.</p>\n<p><strong>Q: A whole column (or several) of LEDs is unlit</strong> </p>\n<p><strong>A:</strong>  Same story as the previous answer - but its one of the top left 5 pins on the right connector, as you look at Plinky from above. Check your joints on the main board, and try again.</p>\n<p><strong>Q:  Some LEDs are ‘stuck on’</strong></p>\n<p><strong>A:</strong>  You’ve got a short somewhere. Check for excessive solder blobs, or ‘bridges’, or places where two pins have become joined together in your sockets and connectors. Look out, if you put loads of solder on, it can wick under the insulation and make it tricky to see the short. Reflow the joints and poke under the insulation if the short refuses to go. If you have a multimeter, check for dead shorts between pins.</p>\n<p><strong>Q:  Touch in a particular column is behaving weirdly, perhaps always registering the highest pad, or the lowest, or jumping from one end to the other wildly. Also, calibration probably complained about that column</strong></p>\n<p><strong>A:</strong>  Same story as the LEDs above, but with the LEFT connector. The left connector is all about the main 64 pads touch interface. It is 8 pairs of pins, left to right corresponding to the vertical columns of touch, also left to right. So if the 3rd row from the left is playing up, and doesn’t respond to touch, you’ve got a broken joint or a short circuit on the 3rd pair of pins from the left. Go check your soldering.</p>\n<p>After you’ve fixed a touch issue, you’ll need to force Plinky to recalibrate. When you power it up, immediately twist the A knob. This will force Plinky into calibration. It will tell you if it’s happy or sad about particular rows.</p>\n<p><strong>Q:  Touch in the bottom strip (with blue LEDs) is responding weirdly. Also, calibration probably complained about it (column 9)</strong></p>\n<p><strong>A:</strong>  See the answer to the previous question, however the pins in question are the two rightmost pins in the top row on the RIGHT pin header, looking at Plinky from the top. After fixing, you will need to recalibrate as above.</p>\n<p><strong>Q: I have more questions! I need more help!</strong></p>\n<p><strong>A:</strong>  Join our dedicated Discord server. It’s very friendly and we can help with any build issues you may encounter. <a target=\"_blank\" rel=\"nofollow\" href=\"https://discord.gg/Zf6chA9jAz\">https://discord.gg/Zf6chA9jAz</a></p>\n<h2 id=\"undefinedcv-calibration-optional-\">CV calibration (optional)</h2>\n<p>If you’re using your Plinky with other eurorack modules, the pitch inputs and outputs should be ‘factory’ calibrated for 1V / Octave. If you find that it is not tracking correctly across multiple octaves, you can recalibrate the pitch CV jacks using the following procedure. You will need a eurorack cable and either a voltmeter, multimeter, or calibrated eurorack oscillator.</p>\n<p>As you power up Plinky, twist the B knob. Plinky will now go into CV calibration mode. Instructions will scroll across the display.</p>\n<p>Plug one end of a eurorack cable into the ‘pitch lo’ output on the right side. Clip a voltmeter to the other end - black to the long metal bit of the jack plug, and red to the tip of the plug. Alternatively, you can plug it into a calibrated eurorack oscillator’s Volt/Octave input and use your ears.</p>\n<p>Slide your finger up and down on the leftmost column of Plinky, it should cause the voltage (pitch) to go slowly up or down. Adjust it until it is as close to 0v as you can get it (or until it sounds like C0 on your oscillator).</p>\n<p>Now touch the second column of Plinky, and it should jump two octaves up - to 2v (C2 on oscillator). Adjust with your finger until it is as close as possible to 2v. You can alternate between the two octaves by pressing the first and second column. Once you are happy it’s a 2 octave gap (2v on the multimeter), move the cable to the pitch hi output on the right, and repeat the 0v and 2v calibration, this time using your finger on the 3rd and 4th columns of Plinky to set the voltages. (1st and 2nd still do ‘pitch lo’, so you can go back any time - just remember to move the cable to the correct output)</p>\n<p>Once you’re happy, unplug the cable at the multimeter / oscillator end, and plug it into the ‘pitch in’ socket on the left, forming a loop-back.</p>\n<p>Plinky should say ‘Just a mo…!’ while it self-calibrates its pitch CV input, and then it will finally ask you to unplug the cable. Once you’ve done that, it will start up in the normal play mode. Calibration is done!</p>\n<h2 id=\"undefinedrecovering-from-a-bricked-plinky\">Recovering from a &#39;bricked&#39; Plinky</h2>\n<h3 id=\"undefinedhelp-my-plinky-is-totally-dead-\">Help! My Plinky is totally dead!</h3>\n<p>If your Plinky becomes corrupted or ‘bricked’, but there are no electrical faults, and it refuses to even go into the normal ‘flashing’ mode (accessed by holding down the encoder on boot), you can force the software to be completely replaced using ‘DFU’ (Device Firmware Update). This is an emergency procedure, you should not need to do this in normal operation.</p>\n<p>You first need to install a DFU flashing program on your computer. I recommend ST Microelectronics’ STM32 Cube Programmer, as they are a somewhat reputable firm, they make the processor chip in Plinky, and their software runs on Mac, Windows and Linux. Unfortunately it requires Java to be installed, but it will guide you through that installation process.</p>\n<p>Get STM32 Cube Programmer for free <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.st.com/en/development-tools/stm32cubeprog.html\">here</a>. </p>\n<p>Mac users: use JDK 8u231 from October 2019.</p>\n<h3 id=\"undefinedforcing-plinky-into-dfu-mode\">Forcing Plinky into DFU mode</h3>\n<p>Once the DFU software is installed on your computer, make sure Plinky is unplugged, remove it from its case, then turn it over, and bridge together the 2 little silver pads marked ‘BOOT0’ - using the tips of metal tweezers, a piece of wire, or any small metal object.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-FW_Boot.jpg\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>While they are connected, power up Plinky over USB. It can be quite tricky to reliably connect the pads while also powering it up, so it may take a few tries. </p>\n<p>If you are successful, the PC should recognise a new USB DFU device. Once detected, you can remove the connection across the pads.</p>\n<p>If you cannot get the PC to recognise the DFU device at all, there may be something electrically wrong. Check all your soldering carefully, check for shorts between power lines with a multimeter, and if that still doesn’t help, ask on the <a target=\"_blank\" rel=\"nofollow\" href=\"https://discord.gg/Zf6chA9jAz\">Discord</a> server. </p>\n<p>Now, run the STM32 Cube Programmer software that you downloaded in the previous step.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_Cube_1.png\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>When you run STM32 Cube Programmer, a large window should appear similar to the image here. If the blue box on the top right isn’t saying USB, click on that to change it to USB.</p>\n<p>Then click the Open File tab, and select the latest <a target=\"_blank\" rel=\"nofollow\" href=\"https://www.plinkysynth.com/firmware\">Plinky firmware DFU file</a>.</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_Cube_2.png\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Now you have the Plinky in DFU mode, the PC software you installed should be showing USB1 in the Port drop down. Press the Refresh button on the top right if the port shows No DFU detected. Once detected, it should show a USB Device with a Serial number, like the picture on the right:</p>\n<p><img src=\"/build-guide-black/Plinky_Build-Guide_Cube_3.png\" alt=\"Plinky DIY Kit – Build Guide\"></p>\n<p>Now click the green Connect button, and then the blue Download button. Wait a few seconds, and it should program. Once it’s done, press Disconnect, and you can unplug your Plinky. Don’t rush. If you unplug mid-program, you may find that you have to repeat this whole process.</p>\n","date":"2024-03-21T16:36:00.000Z","excerpt":"","printDate":"March 21, 2024","toc":[{"anchor":"undefinedsome-tools-you-will-need","level":3,"text":"Some tools you will need"},{"anchor":"undefinedhere-s-what-you-will-find-in-the-kit","level":3,"text":"Here’s what you will find in the kit"},{"anchor":"undefinedbuild-guide","level":2,"text":"Build Guide"},{"anchor":"undefinedremove-the-assembly-rails","level":3,"text":"Remove the assembly rails"},{"anchor":"undefined2x8-header","level":3,"text":"2x8 Header"},{"anchor":"undefinedpotentiometers-jacks-and-screen","level":2,"text":"Potentiometers, Jacks and Screen"},{"anchor":"undefinedplace-green-thonkiconn","level":3,"text":"Place Green Thonkiconn"},{"anchor":"undefinedplace-black-thonkiconn","level":3,"text":"Place Black Thonkiconn"},{"anchor":"undefinedplace-potentiometers-and-encoder","level":3,"text":"Place Potentiometers and Encoder"},{"anchor":"undefinedplace-the-oled-screen","level":3,"text":"Place the OLED screen"},{"anchor":"undefinedplace-panel-thonkiconn-nuts","level":3,"text":"Place Panel + Thonkiconn Nuts"},{"anchor":"undefinedsolder-thonkiconn-and-potentiometers","level":3,"text":"Solder Thonkiconn and Potentiometers"},{"anchor":"undefinedsecure-the-usb-ports","level":3,"text":"Secure the USB Ports"},{"anchor":"undefinedassemble-the-case","level":3,"text":"Assemble the case"},{"anchor":"undefinedcongratulations-your-build-is-done-","level":3,"text":"Congratulations, your build is done!"},{"anchor":"undefinedpower-up-your-plinky","level":3,"text":"Power up your Plinky"},{"anchor":"undefinedcalibration","level":2,"text":"Calibration"},{"anchor":"undefinedtouch-calibration","level":3,"text":"Touch calibration"},{"anchor":"undefinedhappy-plinking","level":3,"text":"Happy Plinking"},{"anchor":"undefinedfirmware","level":2,"text":"Firmware"},{"anchor":"undefinedinstall-firmware","level":3,"text":"Install firmware"},{"anchor":"undefinedinstall-firmware-linux-","level":3,"text":"Install firmware (Linux)"},{"anchor":"undefinedbrowser-based-patch-editor-linux-","level":3,"text":"Browser-based patch editor (Linux)"},{"anchor":"undefinedtroubleshooting-appendix","level":2,"text":"Troubleshooting Appendix"},{"anchor":"undefinedcommon-hardware-issues","level":3,"text":"Common hardware issues"},{"anchor":"undefinedcv-calibration-optional-","level":2,"text":"CV calibration (optional)"},{"anchor":"undefinedrecovering-from-a-bricked-plinky","level":2,"text":"Recovering from a &#39;bricked&#39; Plinky"},{"anchor":"undefinedhelp-my-plinky-is-totally-dead-","level":3,"text":"Help! My Plinky is totally dead!"},{"anchor":"undefinedforcing-plinky-into-dfu-mode","level":3,"text":"Forcing Plinky into DFU mode"}]}