{"title":"Buzzrito build guide - V1","slug":"build-guide_buzzy","html":"<p>Hello! Welcome to the Buzzrito (Buzzy) build  guide.\nBuzzy is quite a simple build, the simplest of the 3 buddies, and fairly beginner friendly. </p>\n<img src=\"/buzzritospin.gif\">\n\n<p><strong>You will need:</strong> a soldering iron, a buzzrito kit, and a little patience.</p>\n<p>Below are most of the parts of the Buzzrito kit, with the exception of the Eurorack power cable and  mounting hardware.</p>\n<p><img src=\"/buzzrito-build-guide/IMG_7214.jpeg\" alt=\"Parts\"></p>\n<h2 id=\"the-panel-header-a-nice-warmup\">The panel header - a nice warmup</h2>\n<p>Let&#39;s get the &#39;SMD&#39; header out of the way - the small 6 pin socket for the front panel.</p>\n<p>Put a small pillow of solder on a <em>single</em> pin on the front panel footprint. You don&#39;t need much solder - just enough to cover the pad.</p>\n<p><img src=\"/buzzrito-build-guide/IMG_7248.jpeg\" alt=\"Solder one pin\"></p>\n<p>now line up the socket and use your iron to heat up the pollow and solder that first pin. It&#39;s worth getting the socket nice and straight, centered, and upright while only 1 pin is soldered. Don&#39;t bend it! just touch your iron to re-heat the pillow and gently move the socket into place while the solder is melted. </p>\n<p>I should note that buzzy in particular is <em>tight</em> - the pads are barely big enough to accomodate the part. err on the side of the connector being shifted towards the big jack holes, and away from the very fine golden traces under the touch pad. Here&#39;s how I lined mine up - you&#39;ll notice that I have got some messy solder into the socket holes. I did this to... show you what <em>NOT</em> to do, honest. You&#39;ll need to clean that up with solder wick later, otherwise you&#39;ll struggle to get the panel on. </p>\n<p><img src=\"/buzzrito-build-guide/IMG_7249.jpeg\" alt=\"Line it up\"></p>\n<p>And here it is, soldered. You only actually need to make electrical connection on &#39;one side&#39; - the other side can just have a tiny amount of solder for rigidity. </p>\n<p><img src=\"/buzzrito-build-guide/IMG_7250.jpeg\" alt=\"Solder one side\"></p>\n<p>Be especially careful on the side with tiny tracks emenating from the connector (shown below) - its ok if you get a bit of solder on the tracks, but you don&#39;t want lots, as you&#39;ll get shorts. If you want to check, stick some pins into the socket and check for shorts with a multimeter. None of the pins should be connected together. The key is to not use too much solder - just enough, and enough heat to get it to flow. Here&#39;s how that side looked for me - not beautiful, but strong, connected, and not shorted:</p>\n<p><img src=\"/buzzrito-build-guide/IMG_7251.jpeg\" alt=\"Solder the other side\"></p>\n<p>That&#39;s the fiddly bit out the way!</p>\n<h2 id=\"soldering-the-eurorack-power-pins\">Soldering the eurorack power pins</h2>\n<p>Your kit may have come with a 2x5 pin header, or a long single strip of single pins. if the latter, break it into 5, 5 and 6 pin pieces - you&#39;ll use the two 5&#39;s for the power.</p>\n<p>Stick the 2x5 pins into the power cable, thus, to line them up:</p>\n<p><img src=\"/buzzrito-build-guide/IMG_7244.jpeg\" alt=\"Power pins\"></p>\n<p>Now, with the cable still attached, put the 5x2 power pins into the back of the main board, where it says &#39;POWER EITHER WAY&#39;.</p>\n<p>Turn it over, and solder one of the pins. Once you are sure everything is flush, solder the rest of the 10 power header pins. <strong>Be careful to avoid melting or disturbing the tiny pre-soldered parts</strong>, and be sure to heat both the pad and the pin before adding solder. These pins are actually the hardest to solder in the entire project, because they are connected to lots of copper inside the board, and will &#39;suck up&#39; a lot of heat. Don&#39;t be afraid to really heat them up, to allow the solder to form a nice joint. Don&#39;t just add lots of solder! If you bridge some of the central 6 pins (ie the center 2x3) that&#39;s not the end of the world, as they are all &#39;ground&#39; - but it&#39;s ugly! :) It will work though. The 2 pins on each end are +12 and -12, so you dont want to bridge them to the center, lest you short out your eurorack power supply. Take your time, it&#39;ll be ok!  </p>\n<p><img src=\"/buzzrito-build-guide/IMG_7246.jpeg\" alt=\"Power header\"></p>\n<h2 id=\"placing-the-hardware-but-not-soldering-it-\">Placing the hardware (but not soldering it)</h2>\n<p>OK Now we&#39;re ready to put the 6 sockets into Buzzrito! Don&#39;t forget the little 6 pin strip - as shown below. <strong>DONT SOLDER ANYTHING YET!</strong> Just plop &#39;em in place. The stereo pairs of thonkiconns actually share a single hole for the &#39;ground&#39; pins, so it can be a bit fiddly, but you can do it! I believe in you!</p>\n<p><img src=\"/buzzrito-build-guide/IMG_7252.jpeg\" alt=\"Loose parts\"></p>\n<p>Why not solder them? You&#39;ll see! Now is the exciting moment we get to place the front panel over the top of everything. The thonkis should all go through the holes, perhaps after a little wiggling and persuasion (good thing you didn&#39;t solder them right!). The 6 pin header and the socket you soldered earlier should mesh together beautifully inside the sandwich. This can be the fiddliest bit - don&#39;t force it, or you may rip the socket off the front panel! I found a trick is to take the 6 pins out of the main board, and put them into the socket, but super loosely, like this:</p>\n<p><img src=\"/buzzrito-build-guide/IMG_7253.jpeg\" alt=\"Loose pins\"></p>\n<p>That way, the pins &#39;dock&#39; into the main board first, then the thonkis, and you can wriggle everything into place.</p>\n<p>Take a moment to marvel at your achievement! Double check all the unsoldered pins came through ok, and then, screw the nuts on top of the panel to the thonkis - it&#39;s really starting to look like a music thing now! </p>\n<p><img src=\"/buzzrito-build-guide/IMG_7217.jpeg\" alt=\"Top view\"></p>\n<h2 id=\"ok-now-you-can-solder-the-hardware\">OK, NOW you can solder the hardware</h2>\n<p>At this point you should solder all of the pins poking through the bottom of the board. Don&#39;t forget any! Especially the 6 pin header. I&#39;ve marked every solder point with a yellow arrow in the image below. Just 21 - not that many! <strong>Be careful to avoid melting or disturbing the tiny pre-soldered parts</strong>.</p>\n<p><img src=\"/buzzrito-build-guide/IMG_7255.jpeg\" alt=\"Not Kittens\"></p>\n<h2 id=\"hardware-victory\">Hardware Victory</h2>\n<p>My goodness! That was it! Double check you got <em>all</em> the solder joints above - are you SURE you got the 6 touch pins? ALL the thonkis? SURE? SURE? OK! - </p>\n<p>All that remains is to tighten the nuts, and perhaps upgrade the software!</p>\n<h2 id=\"the-software-adventure\">The Software Adventure</h2>\n<p>Your Buzzrito kit should come pre-flashed with firmware, so in theory it should just work straight away without any further ado. If you want, go and read the <a href=\"docs/buzzrito-manual\">manual</a>.</p>\n<p>However, if you wish to update Buzzrito, read on.</p>\n<p>First, download the firmware in this file: <a href=\"buzzrito-firmware/buzzrito_001.uf2\"><code>buzzrito_001.uf2</code></a>. Patch notes are available on the manual page.</p>\n<p>Use a USB-C cable (not included) to plug your computer into Buzzrito. You do <strong>not</strong> need Buzzrito to be powered from eurorack for this step. </p>\n<p>Buzzy should show up as a USB drive called <code>RPI-RP2</code> (on mac, you may find it under <code>/Volumes/RPI-RP2</code>). If it does not, try disconnecting the USB cable, holding down the <em>tiny</em> button on the main board, just next to the USB connector (hilighted below), while reconnecting the cable - then release the button. If it <em>still</em> doesn&#39;t show up, make sure your cable has data lines (and isn&#39;t just for charging). And if that&#39;s definitely ok - maybe check your soldering?</p>\n<p><img src=\"/buzzrito-build-guide/IMG_7255_2.jpeg\" alt=\"Boot0\"></p>\n<p>Assuming the drive shows up, drag and drop the <code>buzzrito_xxx.uf2</code> (where xxx is a version number) onto the drive. It should upload the software, and after a second, some LEDs should light up. That&#39;s a good sign! that means Buzzrito is working! </p>\n<p>Assuming all seems well, disconnect it from your PC, carefully connect it to your eurorack system (the power cable can be fitted either way), and -  <em>Happy buzzing</em>!</p>\n<p>If you want, go and read the <a href=\"docs/buzzrito-manual\">manual</a>.</p>\n","date":"2024-10-28T21:50:00.000Z","excerpt":"","printDate":"October 28, 2024","toc":[{"anchor":"the-panel-header-a-nice-warmup","level":2,"text":"The panel header - a nice warmup"},{"anchor":"soldering-the-eurorack-power-pins","level":2,"text":"Soldering the eurorack power pins"},{"anchor":"placing-the-hardware-but-not-soldering-it-","level":2,"text":"Placing the hardware (but not soldering it)"},{"anchor":"ok-now-you-can-solder-the-hardware","level":2,"text":"OK, NOW you can solder the hardware"},{"anchor":"hardware-victory","level":2,"text":"Hardware Victory"},{"anchor":"the-software-adventure","level":2,"text":"The Software Adventure"}]}