{"title":"Manual","slug":"manual","html":"<h1 id=\"plinky-manual\">Plinky Manual</h1>\n<p><em>Plinky is an 8 voice polyphonic touch synthesiser that specialises in fragile, melancholic sounds.</em></p>\n<p><img src=\"/manual-images/plinky.png\" alt=\"\"></p>\n<p>Think of it as an 8 stringed instrument, played by touching the 64 main pads, which are arranged in 8 vertical monophonic strips or strings. </p>\n<p>You can play Plinky straight away with those 64 main pads. The row of 8 &#39;shift&#39; keys (blue LEDs) along the bottom are used in conjunction with the main pads to select parameters, presets, sequencer patterns, and samples.</p>\n<p>Each of the 8 strings has:</p>\n<ul>\n<li>Up to 4 oscillators (pulse, supersaw or wavetable) or sampler grains, detuned by the tiny movements of your finger.</li>\n<li>A white noise generator</li>\n<li>an ADSR envelope controlling...</li>\n<li>...a resonant 2-pole low-pass gate.</li>\n<li>a secondary ADSR envelope with repeat.</li>\n<li>Distortion / saturation</li>\n</ul>\n<p>Plinky supports 4 external CV modulation sources, called A B X Y, each with its own LFO.\nA &amp; B also have dedicated physical offset knobs, located to the left of the screen. When changing parameters you can use the endless encoder to the right of the screen to fine tune the parameter settings. Clicking the encoder also resets the current parameter.</p>\n<p>Plinky also has global delay, reverb, high pass filter, limiter and saturation units along with a simple mixer (for audio inputs), arpeggiator, sequencer and sampler.</p>\n<h2 id=\"quick-start-guide\">Quick Start Guide</h2>\n<p>Congratulations, you have (hopefully) succesfully built your Plinky! Welcome to the Plinky user community. We hope you make and share lots of beautiful music (or pure plain filth if you&#39;re into that).</p>\n<h3 id=\"powering-plinky\">Powering Plinky</h3>\n<p>You can power Plinky by either connecting it to your Eurorack power (it requires a 5V connection) or USB (although it is best not to power through both at the same time). For connecting USB you can use either one of the connectors on the front or the back (but again, don&#39;t use both at the same time!).</p>\n<h3 id=\"calibrating-plinky\">Calibrating Plinky</h3>\n<p>At first power up, (or when you wiggle knob A during the power up,) Plinky will start in Calibration mode. What this does is map the exact size and positioning of your fingers to where it will register a pad being played. For example if you play Plinky from an angle, you will touch the faceplate slightly differently. Calibration compensates for this. </p>\n<p>One white LED in each column will light up. Touch this in the center and the next one will light up. Touch that one in the center, and so on, making sure that the pressure is consistent on each pad.If your finger lands a bit off center from a pad, just slide it into place without lifting it off and leave it for a moment. Do this until all white LEDs have been calibrated and do the same for the Blue LEDs (the shift keys). You are now done.</p>\n<blockquote>\n<p>TIP: if you have large fingers, try calibrating with your little finger! Some people have found that this leads to more responsive playing after calibration.</p>\n</blockquote>\n<p>If you make a mistake during the calibration, just unplug and replug the USB cable. If you ever want to re-calibrate, (for example, because you&#39;ve moved Plinky into or out of your Eurorack, or even if you&#39;ve moved it around,) just wiggle knob A during power up. </p>\n<blockquote>\n<p>We&#39;ve found that changing the case that Plinky&#39;s in, or the power supply you use, can affect calibration. If you find that Plinky isn&#39;t responding correctly, it&#39;s definitely worth re-calibrating. We recommend trying a few different power supplys, as different supplies seem to lead to quite different sensitivities.</p>\n</blockquote>\n<h3 id=\"connect-your-headphones-or-speakers\">Connect your Headphones or Speakers</h3>\n<p>Plinky has two headphone outputs, on the front side and the back side. For each one, it is located to the right of the USB. The jack input on the left is the audio input (for effect processing or sampling). You are now ready to Plink.</p>\n<blockquote>\n<p>TIP: V2 plinky (blue board) has an analog saturation circuit. While the left inputs here are designed for stereo line level inputs, you can actually run full eurorack level &#39;hot&#39; signals into plinky here, and get a really crunchy overdriven sound. Voila! you can use plinky as a saturation/fuzz box. The audio input jack on the top panel is eurorack level, having a lower gain, and will saturate less.</p>\n</blockquote>\n<h3 id=\"play-plinky-\">Play Plinky!</h3>\n<p>Each of the center pads plays a note. Plinky is either playing a blank preset, which is a 4 voice unison Saw wave for each of the &#39;strings&#39;, or you are playing one of the factory presets that come with later versions of Plinky. Plinky can play 8 voices polyphony. Enjoy!</p>\n<h3 id=\"changing-the-sound\">Changing the Sound</h3>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\">\n<img src=\"/manual-images/hold.svg\" alt=\"hold...\">\n<img src=\"/manual-images/delay--reverb.svg\" alt=\"Delay\">\n<img src=\"/manual-images/tap.svg\" alt=\"tap!\"><br>To enter parameter edit mode you hold down a shift button, and while holding it down, select one of the icon pads. Then you release all your fingers. The bottom row of buttons are the shift / transport / mode buttons, with the blue LEDs. Its LED lights up while you have your finger held down on it. While in parameter edit mode, both the shift button and the icon pad&#39;s LEDs will flicker. The screen shows the device you are editing in the upper half and the parameter in the lower half.\nNow, let&#39;s use this workflow to add some delay. Tap and hold the bottom left button, the ‘primary’ parameter editing button, referred to as <em>SHIFT TOP</em> from here on. Tap the <em>delay</em> pad, second column third row. This is the send level to the delay unit. you are now in parameter edit mode. Slide your finger upwards on the leftmost column of pads to increase the amount of delay. To hear this, play any of the pads other than the most left column (which acts as a slider). Play &amp; tweak. Alternatively, you can twist the encoder (right knob) to adjust the value finely. Click the encoder to reset the value to default. Tap the <em>SHIFT TOP</em> button to return to &#39;full play mode&#39;, where you can use the left most column for notes. That’s the basic workflow for creating patches in Plinky!</p>\n<h3 id=\"adding-modulation\">Adding Modulation</h3>\n<p>Adding modulation has a similar workflow. You tap and hold down a shift button, and select a parameter to enter parameter edit mode like before, but now you keep on holding down the shift button and tap one of the mod sources (the right most column of icon pads). </p>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\">\n<img src=\"/manual-images/hold.svg\" alt=\"Hold...\">\n<img src=\"/manual-images/distortion--resonance.svg\" alt=\"Distortion\">\n<img src=\"/manual-images/tap.svg\" alt=\"Tap!\">\n<img src=\"/manual-images/mod-src--a.svg\" alt=\"Mod Source A\">\n<img src=\"/manual-images/tap.svg\" alt=\"Tap!\"></p>\n<p>Let’s use the physical knob at the top left of Plinky to adjust overdrive. Hold Down <em>SHIFT TOP</em> again, then tap <em>drive</em> (third columd first row) to select overdrive. While still holding down <em>SHIFT TOP</em>, tap the <em>MODULATOR A</em> pad on the right column. What you are saying to plinky is, &#39;I want to link modulation source A to the parameter <em>distortion</em>&#39;. Now you&#39;ll see three blinking LEDS: the shift button, the parameter pad and the modulation pad. The screen still shows the parameter you are editing in the lower half, but the upper half now shows the modulation source instead of the sound device. \nYou have now linked the modulation source, but you also have to tell Plinky how much that modulation should impact the overdrive. You do this with the left slider, or the encoder for fine adjustments. In this case we want the knob to control the full overdrive range, so we turn it all the way up with the slider (turning the knob fully counter clockwise adds 0% overdrive, turning it all the way clockwise adds 100% overdrive). Now, the physical knob at the top left of Plinky will control overdrive. To switch between adjusting the &#39;base value&#39; of the parameter and the &#39;modulation amount&#39; you can tap top right <em>MODULATOR_BASE</em>. To return to full play mode, tap <em>SHIFT TOP</em> one more time. That’s as complex as it gets! You now know everything you need to know to play, edit patches and modulate. Enjoy! Details follow.</p>\n<blockquote>\n<p>To remove a parameter&#39;s modulation, simply repeat the steps as described, and turn modulation amount back to 0% (clicking the encoder is perfect for this). To see which modulation sources are linked to a parameter, select it and check which of the modulator LEDs light up. Use <em>MODULATOR Base</em> to switch between &#39;base value&#39; and &#39;modulation amount&#39;\n<img src=\"/manual-images/mod-src--base.svg\" alt=\"Modulator Base\">  </p>\n</blockquote>\n<h1 id=\"plinky-hardware\">Plinky hardware</h1>\n<h2 id=\"top-and-bottom-edge\">Top and bottom edge</h2>\n<p><img src=\"/manual-images/edges.jpg\" alt=\"\">\nLet’s take a look at Plinky’s inputs and outputs on the top and bottom edges. They have identical functions, and both can be used. On each side you find:</p>\n<h4 id=\"audio-in-line-level-stereo-\">Audio in (line level stereo)</h4>\n<p>A TRS, ⅛” audio jack. Useful for two things. Plinky’s sampler can sample 65 seconds of incoming audio. Additionally, Plinky can act as a mixer with effects (reverb and delay), where each of Plinky’s audio inputs are mixed with Plinky’s internal audio. The individual inputs are mixed at unity gain, but the levels of the summed inputs and the internal sounds can be set separately. </p>\n<blockquote>\n<p>Remember, if you have Plinky V2 (with the blue main board) you can and absolutely should try running Eurorack signals through Line level inputs to enloy that crunchy analog saturation. </p>\n</blockquote>\n<h4 id=\"usb\">USB</h4>\n<p>Micro USB slot. It can power Plinky.  Warning -- do not attempt to power Plinky with both USB and Eurorack simultaneously. \nUSB is also used for MIDI in/out. It needs a USB host, so you can connect it to your computer and integrate Plinky into your DAW. It has polyphonic aftertouch, and most parameters can be edited over MIDI (see the MIDI chapter). Finally, USB is used for Firmware, preset and wavetable updates.</p>\n<ul>\n<li>Firmware files are in the form of: <code>CURRENT.UF2</code></li>\n<li>Wavetable files are in the form of: <code>WAVETAB.UF2</code></li>\n<li>Preset files are in the form of: <code>PRESETS.UF2</code></li>\n</ul>\n<p>When copying over any of these, make sure the filename matches.</p>\n<h4 id=\"audio-out-line-level-stereo-\">Audio out (line level stereo)</h4>\n<p>A TRS ⅛”audio jack that outputs the mixed output at line level. </p>\n<h2 id=\"main-interface\">Main Interface</h2>\n<p>Plinky is built around 64 playable ‘pads’. Actually they are not really pads, they are zones on a vertical strip. By calibrating Plinky’s touch strips, we make them function as pads. </p>\n<h3 id=\"top-row\">Top Row</h3>\n<h4 id=\"knobs-a-b\">Knobs A &amp; B</h4>\n<p>These two knobs act as offsets for modulator A and B respectively. Modulator A is the sum of LFO A, CV input A and the offset of the button. These modulators can be assigned to all the parameters</p>\n<h4 id=\"screen\">Screen</h4>\n<p>Plinky&#39;s screen may be small, but it shows a lot of useful information. There are three modes, each have their own interface on the screen: Play mode, Parameter Edit mode and Sampler mode\n<strong>Play mode</strong>\nPlinky’s screen shows the last note played on the top left. On the bottom left we see the current sequencer/arp pattern. To the right of the arp/seq pattern number we see if, and if yes, which sample is selected. All the way on the right, a narrow bar shows the current pressure (max from each of the strings) that is being applied to the pads. Also on the right (left of the pressure bar) you see 4 small visualisations of modulator/LFO A, B, X and Y. The center shows a nice big waveform of what’s being played through the Mixer stage.\n<strong>Parameter edit mode</strong>\nTop left shows the device you are currently editing (Sound, Envelope, Delay, Reverb, Arp, Sequencer, A, B, X, Y, Sampler, Mixer, System)\nBottom left shows which parameter of the current device is being edited.\nOn the right we still see the pressure bar and the modulators. In the center we see one or two parameter values. In the upper half of the screen we see a big number, which is the current actual value of the parameter. When no modulation is applied, you will only see the big value, because the the base value and the total is equal, which you set with the slider or the encoder. \nWhen modulation is applied, you will see 2 numbers. The small number in the lower half of the screen is the base value of the preset, the large number in the upper half is the sum of the base values and all modulation. This means that the base value is a static number, while the current value will change with the modulation (for example, an LFO). The small value is the one you can set with the slider/encoder, and the large value is the result of this.\n<strong>Sampler Mode</strong>\nIn Sampler mode you will see a large visualisation of the sample with vertical bars representing one of the 8 slice points. A small number to the right of this bar tells you which slide it is. \nOn the bottom left we see the mode the sampler is in (tape/pitch). When in pitch mode, we see the base note of the current slide. On the bottom right we see the sampler playback mode (all, loop, loop all)</p>\n<h4 id=\"encoder\">Encoder</h4>\n<p>ENC_P\nThe push encoder is used to set parameter values. Values can often be negative and positive, where different types of units correspond to the positive or negative values (eg. in the shape parameter, negative values modulate the Pulsewidth of a pulse wave, at 0 it is a supersaw, when positive it is a wavetable).</p>\n<p>The encoder remains tied to the parameter that was last edited, even when Plinky is not in parameter edit mode. </p>\n<p>When pushed, the encoder will snap the parameter value back to 0. This is useful to remove modulation from a parameter. A long push on the encoder  clears the modulation.</p>\n<h3 id=\"columns-of-jacks\">Columns of Jacks</h3>\n<p>The column of jacks on the left are all inputs. The column of jacks on the right are all outputs. Their individual functions are described in detail in the ‘Eurorack’ chapter. </p>\n<h3 id=\"bottom-row-shift-keys-\">Bottom Row (Shift Keys)</h3>\n<p>The Bottom row of pads (blue leds), are shift and transport controls, from left to right: </p>\n<h4 id=\"shift-top-shift-bottom\">Shift Top &amp; Shift Bottom</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\">  <strong>Edit Mode</strong> The first two shift buttons are the most important: they allow you to modify the sound. Why two? They map to two complete sets of parameters – primary (top) on SB_PARAMS_TOP and secondary (bottom) on SB_PARAMS_BOT, corresponding to the parameters that are written above and below each of the pads. Tap or hold either, then tap an icon pads to choose a parameter to edit.</p>\n<p>Once in edit mode, adjust the chosen parameter using the left most column of pads as a slider, or use the encoder to the left of the screen. While in this mode you can play all the pads, except for the left most (slider) pads. Tap again to return to play mode (LED off). </p>\n<h4 id=\"preset\">Preset</h4>\n<p><img src=\"/manual-images/preset.svg\" alt=\"Preset\">  <strong>Preset Mode</strong> Tap or hold, then tap a main pad to select a preset (left 32 pads), pattern (middle 24), or sample (right 8). A long press on a sample pad will edit it; on other pads, it will copy the current preset / pattern to it. Press and hold SB_CLEAR to clear the last touched preset or pattern.</p>\n<h4 id=\"previous\">Previous</h4>\n<p><img src=\"/manual-images/previous.svg\" alt=\"Previous\"> <strong>Previous Button</strong> Tap to jump to the previous step (sequencer paused) or first step (sequencer playing). <em>Or, hold it then tap a main pad to jump to a step within the current loop, or to set a new loop start outside the current loop.</em></p>\n<h4 id=\"next\">Next</h4>\n<p><img src=\"/manual-images/next.svg\" alt=\"Next\"> <strong>Next Button</strong> Tap to jump to the next step.<br><em>Or, hold it then tap a main pad to set the end of the current loop.</em></p>\n<h4 id=\"clear\">Clear</h4>\n<p><img src=\"/manual-images/clear.svg\" alt=\"Clear\"> <strong>Clear Button</strong> Tap or hold to clear stuff. Useful to mute recorded notes, live, while the sequencer is playing. If recording, this will permanently clear steps.\nIn preset mode, hold this after tapping a main pad to clear whole patterns or re-initialize presets. </p>\n<h4 id=\"record-and-play\">Record and Play</h4>\n<p><img src=\"/manual-images/record.svg\" alt=\"Record\"> <img src=\"/manual-images/play.svg\" alt=\"Play\"> <strong>Play / Record Buttons</strong> Tap to toggle playback &amp; recording.\nRecording can be step based (when sequencer is paused) or realtime (when sequencer is playing). When you enter a note (or multiple notes, the sequencer is polyphonic) the sequencer jumps to the next step.</p>\n<h3 id=\"center-pads-leds\">Center Pads &amp; LEDs</h3>\n<p>The pads have two functions. Their prmary role is to play notes, in default presets the bottom left pad plays C0. Each pad up is 1 note higher within the selected scale, each string is tuned 7 semitones or a perfect fifth up (but snapped to the closest note in the scale).</p>\n<p>The second function of the pads is to select parameters. The left most column acts as a slider to modify parameter values. The right most column refer to the modulators. The center 48 pads each correspond to 2 parameters, which are printed directly above and below the pad. The parameters are described in the Parameters chapter.</p>\n<p>Each pad also has a white LED (unless you decided to get creative in your build and install other colors, in which case, <em>do share!</em>) These LEDs have different behaviours in the various modes:\nin <strong>play mode</strong> the LEDs light up the notes that are being played, as well as the active sequencer step.\nin <strong>parameter mode</strong> the LEDs show both the parameter that is being edited and the modulators that have been assigned to that parameter. So when a parameter is changing unexpectedly, you can select the parameter and then the modulator that is causing the cange will also light up. \nin <strong>preset mode</strong> the LED&#39;s show the active preset, sequencer pattern and current sample (when in sample mode)</p>\n<h1 id=\"parameters\">Parameters</h1>\n<p>Plinky’s parameters are arranged in somewhat logical horizontal rows. Remember to touch/hold SB_PARAMS_TOP or SB_PARAMS_BOT to enter parameter edit mode, then touch a pad with an icon to select that parameter. The left most column then becomes a dedicated slider, or you can use the encoder right of the screen. Pressing SB_PARAMS_TOP or SB_PARAMS_BOT again leaves the left slider active, allowing you to continue to tweak a single parameter while playing with the majority of the pads. Pressing SB_PARAMS_TOP or SB_PARAMS_BOT a third time returns to play mode, with all 64 pads available to play. This is the main workflow when making patches with Plinky.</p>\n<p>The leftmost column of pads is a slider. The rightmost column of pads are modulation sources. We’ll cover those later. The middle 6 columns are the parameters themselves. From top to bottom, they are:</p>\n<h1 id=\"sound-synthesizer-\">Sound (Synthesizer)</h1>\n<h4 id=\"shape\">Shape</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/shape.svg\" alt=\"Shape\">  Controls the shape of the oscillators in Plinky. When exactly 0%, you get  4 sawtooths per voice. When positive, you blend smoothly through 16 ROM wavetable shapes, (2 per voice,) provided by @miunau. When negative, you get PWM control of pulse/square shapes, (also 2 per voice.)</p>\n<p>CV and internal modulation only work either positive or negative: you can blend through the wavetables when the parameter is over 0, or you can modulate pulse/square waves when the value is negative. You cant cross through zero.</p>\n<p>Plinky pans each set of oscillators, (and the sample grains) a little giving the sound a rich stereo field. With the supersaw, we have 2 oscilators panned left and 2 panned right. With the wavetable and pulse oscilators 1 is panned left and 1 is panned right.</p>\n<blockquote>\n<p>Tip: Honestly, just play with this one for a bit. Assign it to a knob, play an arp or pads and listen to the rich, full scope of sounds Plinky will play. From there on see for yourself. Add an envelope to it, or let pressure modulate the timbre of the sound.</p>\n</blockquote>\n<h4 id=\"noise\">Noise</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/noise.svg\" alt=\"Noise\">  Each voice can add a variable amount of white noise to the oscillator, before the low-pass gate. Try assigning an envelope to the noise parameter. An envelope with a short attack and decay will give a percussive feel, while longer attack will ‘wash over’ the sound which is more suitable for pads.</p>\n<h4 id=\"drive\">Drive</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/distortion--resonance.svg\" alt=\"Distortion\">  When turned up high, the saturation unit will create guitar-like tones, especially when playing polyphonically. It can also be used to compensate for changes in volume, for example if the Sensitivity parameter is low.</p>\n<h4 id=\"resonance\">Resonance</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/distortion--resonance.svg\" alt=\"Resonance\">   Each voice has a 2-pole lowpass gate controlled by your finger pressure and the Sensitivity control. This parameter adds resonance to the filter. Note that at high levels of resonance, you may wish to adjust the drive or the high pass filter parameters.</p>\n<h4 id=\"pitch\">Pitch</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/pitch.svg\" alt=\"Pitch\">  Use this to (fine) tune Plinky. Range is 1 octave up or down, unquantized.\nTip: By default Plinky is tuned to C, so to play in G we could set this value to either 7 or - 5</p>\n<h4 id=\"degree\">Degree</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/degree.svg\" alt=\"Degree\">  Think of this as a quantized pitch control, that transposes plinky in such a way that all the notes stay in the same scale. In other words, it changes which degree of the scale is played, but not the root of the scale itself.</p>\n<h4 id=\"octave\">Octave</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/octave--scale.svg\" alt=\"Octave\"> Use this to quickly change pitch, quantised to octaves.</p>\n<h4 id=\"scale\">Scale</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/octave--scale.svg\" alt=\"Scale\"> Selects which scale of notes plinky uses.  </p>\n<h4 id=\"the-following-scales-are-available-\">The following Scales are available:</h4>\n<ul>\n<li>Major</li>\n<li>Minor</li>\n<li>Harminoc Min</li>\n<li>Penta Maj</li>\n<li>Penta Min</li>\n<li>Hirajoshi</li>\n<li>Insen</li>\n<li>Iwato</li>\n<li>Minyo</li>\n<li>Fifths</li>\n<li>Triad Maj</li>\n<li>Triad Min</li>\n<li>Dorian</li>\n<li>Phrygian</li>\n<li>Lydian</li>\n<li>Mixolydian</li>\n<li>Aeolian</li>\n<li>Locrian</li>\n<li>Blues Min</li>\n<li>Blues Maj</li>\n<li>Romanian</li>\n<li>Wholetone</li>\n<li>Harmonics</li>\n<li>Hexany</li>\n<li>Just</li>\n<li>Chromatic</li>\n</ul>\n<h4 id=\"glide\">Glide</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/glide--microtone.svg\" alt=\"Glide\">  Controls the speed of the portamento between notes in a single voice. Higher = slower</p>\n<h4 id=\"microtone\">Microtone</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/glide--microtone.svg\" alt=\"Microtone\">  Controls how much vertical movement of your finger detunes the note. This also thickens the sound through &#39;unison&#39; detuning of the individual oscillators in each note, so values above 0 are recommended.</p>\n<h4 id=\"osc-interval\">Osc Interval</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/osc-interval--column.svg\" alt=\"Osc Interval\">  Each voice has several oscillators, and this sets a fixed interval between them, from +1 to -1 octaves.</p>\n<h4 id=\"stride-column-\">Stride (Column)</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/osc-interval--column.svg\" alt=\"Stride\">  Controls the interval, in semitones, between each column of plinky. It defaults to 7 semitones, a perfect fifth, like a Cello or Violin. The notes are always snapped to the chosen scale, even if the stride calls for chromatic notes, so plinky does its best to choose column pitches that follow this stride while staying in-scale.</p>\n<h2 id=\"envelope-generator\">Envelope Generator</h2>\n<p><img src=\"/manual-images/attack.svg\" alt=\"Attack\"> <img src=\"/manual-images/decay.svg\" alt=\"Decay\"> <img src=\"/manual-images/sustain.svg\" alt=\"Sustain\"> <img src=\"/manual-images/release.svg\" alt=\"Release\">  Plinky has two Envelope Generators. Envelope 1 (the upper parameter) is mapped to the Low Pass Gates and has Attack, Decay, Sustain and Release stages. Envelope 2 (the bottom parameter) is unassigned by default and can be mapped to parameters with the Envelope modulator pad. Like Envelope 1 it is an ADSR envelope. The parameters on the same pads.</p>\n<h4 id=\"sensitivity\">Sensitivity</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/sensitivity--env-2-level.svg\" alt=\"Sensitivity\">   Master sensitivity, controlling the mapping of finger pressure to the opening/closing of each voice&#39;s low-pass gate. If you are looking for a lowpass cutoff frequency, this is the parameter you want.</p>\n<h4 id=\"envelope-2-level\">Envelope 2 Level</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/sensitivity--env-2-level.svg\" alt=\"Envelope 2 Level\">  Sets the peak level of the second envelope, which can be used as a modulation source.</p>\n<h4 id=\"attack-1-2\">Attack 1 &amp; 2</h4>\n<p><img src=\"/manual-images/attack.svg\" alt=\"Attack\"> <strong>Attack time.</strong> Attack (top) is for the main envelope that controls the lowpass gate. The peak level is set by the pressure of your finger, modulated by the Sensitivity parameter. Attack (bottom) controls the attack time for the secondary envelope. The peak level is controlled by ENV 2 Level.</p>\n<h4 id=\"decay-1-2\">Decay 1 &amp; 2</h4>\n<p><img src=\"/manual-images/decay.svg\" alt=\"Decay\"> <strong>Decay time.</strong> Decay (top) is for the main envelope that controls the decay time for the lowpass gate. Decay (bottom) controls the decay time of the secondary envelope.</p>\n<h4 id=\"sustain-1-2\">Sustain 1 &amp; 2</h4>\n<p><img src=\"/manual-images/sustain.svg\" alt=\"Sustain\"> <strong>Sustain level.</strong> Sustain (top) is for the main envelope that controls the sustain level for the lowpass gate. Sustain (bottom) controls the sustain level of the secondary envelope.</p>\n<h4 id=\"release-1-2\">Release 1 &amp; 2</h4>\n<p><img src=\"/manual-images/release.svg\" alt=\"Release\"> <strong>Release time.</strong> Release(top) is for the main envelope that controls the release time for the lowpass gate. Release (bottom) controls the release time of the secondary envelope.</p>\n<h2 id=\"master-effects\">Master Effects</h2>\n<p><img src=\"/manual-images/FX.svg\" alt=\"effects\">  Plinky has 2 send/return effects: a Delay and a Reverb. They can be added to both the Synth/Sampler outputs and to the audio coming in through one of the input jacks. The parameters in this section apply to the effect parameters, where the Send parameter determines how much of the effect is sent to the mixer. In the mixer section you can adjust the dry/wet settings for the effects. </p>\n<h4 id=\"delay-send\">Delay Send</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/delay--reverb.svg\" alt=\"Delay\">  Amount of the dry sound sent to the delay unit.<br>Turn it up for echos!</p>\n<h4 id=\"delay-time\">Delay Time</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/time.svg\" alt=\"Delay Time\">  The time between each echo. Positive values are un-quantized; negative values are multiples of the current tempo.</p>\n<h4 id=\"delay-ratio\">Delay Ratio</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/pingpong--shimmer.svg\" alt=\"Pingpong\">  The delay unit is stereo. This moves the right tap to an earlier time, causing ping-pong poly-rhthmic repeats. Try simple ratios like 33%, 50%, 75%.</p>\n<h4 id=\"delay-wobble\">Delay Wobble</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/wobble.svg\" alt=\"Delay Wobble\">  Amount of simulated tape speed wobble, causing pitch distortions in the delay.</p>\n<h4 id=\"delay-feedback\">Delay Feedback</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/feedback.svg\" alt=\"Delay Feedback\">  Amount of feedback - the volume of each echo reduces by this amount.</p>\n<h4 id=\"reverb-send\">Reverb Send</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/delay--reverb.svg\" alt=\"Reverb send\">  Amount of the dry sound sent to the reverb unit. Turn it up for reverb!</p>\n<h4 id=\"reverb-time\">Reverb Time</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/time.svg\" alt=\"Reverb Time\">  Controls the length of the decay of the reverb.</p>\n<h4 id=\"shimmer\">Shimmer</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/pingpong--shimmer.svg\" alt=\"Shimmer\">  Amount of octave-up signal that is fed into the reverb, causing a shimmer effect.</p>\n<h4 id=\"reverb-wobble\">Reverb Wobble</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/wobble.svg\" alt=\"Reverb Wobble\">  Amount of simulated tape speed wobble, causing pitch distortions in the reverb. Avoids metallic artefacts.</p>\n<h2 id=\"arpeggiator-sequencer\">Arpeggiator &amp; Sequencer</h2>\n<p>Plinky has a powerful arpeggiator and sequencer, Each with their own quirks. The arpeggiator can be latched (when you lift your fingers the last notes / pressure  is continued). Besides the obvious clock divisions / multiplications, the arpeggiator can also play euclidean patterns or random rhythms. Additionally the arp has some interesting order/modes, that allow for even more complex rhythms and/or polyphonic arps. \nThe sequencer is polyphonic. The sequencer can also control the arpeggiator: If both are on, the sequencer will play patterns of arps. As both the sequencer and the arpeggiator’s clocks can be divided to up to 256x the clock’s speed, this allows for very long, complex patterns. [TO DO] As the latch on/off and the Arp on/off will become mappable parameters, this allows for even more extensive sequencing possibilities. </p>\n<h4 id=\"tempo-bpm\">Tempo / BPM</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/tempo--swing.svg\" alt=\"Tempo\">  Tempo in BPM. You can also tap this parameter pad rhythmically to set the tempo. It controls the sequencer, arpeggiator and clocked parameters (like echo time for synced delays) and devices</p>\n<h4 id=\"swing\">Swing</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/tempo--swing.svg\" alt=\"Swing\">  [OUT OF ORDER]. This parameter will be used to add swing in a future firmware update</p>\n<h4 id=\"latch\">Latch</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/arp--latch.svg\" alt=\"latch\">  Switches the latch on/off. When on, played notes will sustain even when you take your fingers off plinky. Useful for chords, arps, drones, or using plinky as an oscillator voice.</p>\n<h3 id=\"arpeggiator\">Arpeggiator</h3>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/arp--latch.svg\" alt=\"Arp\">  Switches the arpeggiator on and off.</p>\n<h4 id=\"arpeggiator-mode-order-top-\">Arpeggiator Mode / Order (Top)</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/order.svg\" alt=\"Arp Mode\"> Select the arpeggiator mode.</p>\n<h4 id=\"the-following-arpeggiator-modes-are-available-\">The following arpeggiator modes are available:</h4>\n<ul>\n<li>Up</li>\n<li>Down</li>\n<li>Up then Down</li>\n<li>Up then Down (repeat end notes)</li>\n<li>Up with lowest note pedal</li>\n<li>Down with lowest note pedal</li>\n<li>Up then down with lowest note pedal</li>\n<li>Random</li>\n<li>Random playing 2 notes at a time</li>\n<li>Repeat all notes (polyphonic)</li>\n<li>Up (all 8 columns)</li>\n<li>Down (all 8 columns)</li>\n<li>Up then Down (all 8 columns)</li>\n<li>Random (all 8 columns)</li>\n<li>Random, 2 notes at a time (all 8 columns)</li>\n</ul>\n<p>The &#39;8 column&#39; modes include every column, even those without a note, introducing rests into the arpeggio. </p>\n<h4 id=\"arpeggiator-clock-division\">Arpeggiator Clock Division</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/clock-div.svg\" alt=\"Arp Clock Division\">  Sets the speed of the arpeggiator. Negative numbers are un-quantized, positive numbers divide a 32nd note clock. The following divisions are available:</p>\n<ul>\n<li>1/32</li>\n<li>2/32 </li>\n<li>3/32</li>\n<li>4/32</li>\n<li>5/32 </li>\n<li>6/32</li>\n<li>8/32</li>\n<li>10/32 </li>\n<li>12/32</li>\n<li>16/32</li>\n<li>20/32 </li>\n<li>24/32</li>\n<li>32/32</li>\n<li>40/32 </li>\n<li>48/32</li>\n<li>64/32</li>\n<li>80/32 </li>\n<li>96/32</li>\n<li>128/32</li>\n<li>160/32 </li>\n<li>192/32 </li>\n<li>256/32</li>\n</ul>\n<h4 id=\"arpeggiator-chance-density-top-\">Arpeggiator Chance / Density (top)</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/chance.svg\" alt=\"Arpeggiator Chance\">  Sets the probability of the arpeggiator progressing on each tick of its clock. If the arp length parameter is 0, this is a true random probability, otherwise it&#39;s the density of a euclidean rhythm.</p>\n<h4 id=\"arpeggiator-euclidian-length-top-\">Arpeggiator Euclidian Length (top)</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/euclid-len.svg\" alt=\"Arpeggiator Euclid Length\">  When non zero, this sets the length of the euclidean pattern used by the arp. Use the arp probability parameter to change how many notes are included in each pattern. Negative values treat rests differently, try both.</p>\n<h4 id=\"arpeggiator-octaves\">Arpeggiator Octaves</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/arp-octaves.svg\" alt=\"Arpeggiator Octaves\">  Sets how many octaves the arpeggiator ranges over. This means that if you only play 1 note, the arp will play as many octaves of that note (upwards) as you have set the parameter to.</p>\n<h3 id=\"sequencer\">Sequencer</h3>\n<h4 id=\"sequencer-mode-order\">Sequencer Mode / Order</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/order.svg\" alt=\"Sequencer Mode\">  Sets the order in which steps are played by the sequencer.</p>\n<ul>\n<li>Pause</li>\n<li>Forwards</li>\n<li>Backwards</li>\n<li>Pingpong</li>\n<li>Pingpong (repeat end notes)</li>\n<li>Random</li>\n</ul>\n<h4 id=\"sequencer-clock-division\">Sequencer Clock Division</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/clock-div.svg\" alt=\"Sequencer Clock Division\">  Sets the speed of the sequencer. Negative numbers are un-quantized, positive numbers divide a 32nd note clock. The following divisions are available:</p>\n<ul>\n<li>1/32</li>\n<li>2/32 </li>\n<li>3/32</li>\n<li>4/32</li>\n<li>5/32 </li>\n<li>6/32</li>\n<li>8/32</li>\n<li>10/32 </li>\n<li>12/32</li>\n<li>16/32</li>\n<li>20/32 </li>\n<li>24/32</li>\n<li>32/32</li>\n<li>40/32 </li>\n<li>48/32</li>\n<li>64/32</li>\n<li>80/32 </li>\n<li>96/32</li>\n<li>128/32</li>\n<li>160/32 </li>\n<li>192/32 </li>\n<li>256/32</li>\n</ul>\n<h4 id=\"sequencer-chance-density\">Sequencer Chance / Density</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/chance.svg\" alt=\"Chance\">  Sets the probability of the sequencer progressing on each tick of its clock. If the sequencer length parameter is 0, this is a true random probability, otherwise it&#39;s the density of a euclidean rhythm.</p>\n<h4 id=\"sequencer-euclidian-length\">Sequencer Euclidian Length</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/euclid-len.svg\" alt=\"Euclidian Length\">  When non zero, this sets the length of the euclidean pattern used by the sequencer. Use the sequencer probability parameter <em>(density bottom)</em> to change how many notes are included in each pattern. Negative values treat rests differently, try both.</p>\n<h4 id=\"sequencer-gate-length\">Sequencer Gate Length</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/gate-len.svg\" alt=\"Sequencer Gate Length\">  Sets the length of the gate of each step. The gate is the signal that determines whether a note is on or off. Longer gates means notes are played longer, which (in tandem with Envelope 1) determines how long notes are sustained.</p>\n<h2 id=\"sampler\">Sampler</h2>\n<p><img src=\"/manual-images/SAMPLER.svg\" alt=\"sampler\">  Plinky lets you record 8 samples, each split into 8 &#39;slices&#39;, corresponding to the 8 columns (strings). Once recorded, the bottom row of parameters control the granular playback of your samples.</p>\n<p>To record or edit a sample, press <em>PRESET</em> to go into preset mode, then press and hold one of the 8 rightmost pads. Now press and hold <em>RECORD</em> to record a new sample. Plinky will first have to clear the data stored for that slot which will take a few seconds. Use knob A to adjust the recording level.\nPress <em>RECORD</em> or <em>PLAY</em> to &#39;arm&#39;. Plinky will start recording when it hears audio, or tap <em>RECORD</em>/<em>PLAY</em> again to start recording silence. </p>\n<p>If you want to set the 8 slice points while recording, tap any of the main pad buttons at the start of each slice. If not, Plinky will cut the sample into 8 equal length slices. You can edit the split points later. Press <em>RECORD</em> or <em>PLAY</em> any time to stop recording. </p>\n<p>When recording is finished, to audition the slices, press and hold the main pad buttons along the top row. If you slide your finger up and down, it adjusts the start point of each slice. </p>\n<p>There are two options associated with samples, controlled by the usual 2 parameter shift keys <em>SHIFT TOP</em>/<em>SHIFT BOTTOM</em>: Tape/Pitch mode and Loop mode. \nPress <em>SHIFT BOTTOM</em> to cycle loop mode between &#39;play slice&#39;, &#39;loop slice&#39;, &#39;play all&#39;, &#39;loop all&#39;.\nPress <em>SHIFT TOP</em> to toggle between Tape mode and Pitch mode.</p>\n<p>Tape mode lays out the sample slices across all 64 pads, top to bottom then left to right, allowing you to quickly play from any point within the sample by pressing the appropriate pad. The pitch of playback is only affected by the &#39;sample rate&#39; parameter.</p>\n<p>In Pitch mode, each slice is assigned a base pitch, visible like &#39;C#3&#39; in the OLED display. You can set this reference pitch for each slice, by sliding your finger in the lower half of the main pad area. Now when you perform notes in plinky, it has set up a multisample key-split and chooses the closest pitched slice to the desired note. Be careful of octaves to be sure to use all your slices. If multiple slices have the same pitch, they will be round-robined.</p>\n<p>Press <em>CLEAR</em> to leave sample edit mode.</p>\n<h4 id=\"scrub\">Scrub</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/scrub--jitter.svg\" alt=\"Scrub\">  Controls the starting point of the sample playback, relative to the slice point. If you modulate this parameter you get dynamic slicing.</p>\n<h4 id=\"scrub-jitter\">Scrub Jitter</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/scrub--jitter.svg\" alt=\"Scrub\">  Adds an amount of randomness to the sample playback position.</p>\n<h4 id=\"grain-size\">Grain Size</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/grain-size--jitter.svg\" alt=\"Grain Size\">  Sets the size of the grains. Modulate to achieve granular sound effects.</p>\n<h4 id=\"grain-size-jitter\">Grain Size Jitter</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/grain-size--jitter.svg\" alt=\"Grain Size\">  Adds an amount of randomness to the sample grain size.</p>\n<h4 id=\"play-speed\">Play Speed</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/play-speed--jitter.svg\" alt=\"Play Speed\">  Determines at what relative speed the sample is played back, eg. 50% slows the sample down by a factor of 2, 200% speeds up the sample twice. Playback speed affects the pitch of the sample accordingly, slowing the sample down pitches it down, speeding up also pitches up.</p>\n<h4 id=\"play-speed-jitter\">Play Speed Jitter</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/play-speed--jitter.svg\" alt=\"Play Speed\">   Adds an amount of randomness to the sample playback speed.</p>\n<h4 id=\"time-stretch\">Time Stretch</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/timestretch.svg\" alt=\"Time Stretch\">  Determines at what relative speed the sample is played back, but without changing the pitch. As the sample is cut up in miniscule ‘grains’ of audio (milliseconds), Plinky repeats some of these grains to slow down, and leaves some grains out to speed up. Changes in grain size have more drastic effects when samples are stretched severely. </p>\n<h4 id=\"sample\">Sample</h4>\n<p><img src=\"/manual-images/sample.svg\" alt=\"Sample\">  Controls which sample is being played, allowing you to change samples from within a preset by assigning a LFO or CV source to this parameter.</p>\n<h4 id=\"pattern\">Pattern</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/pattern--step-offset.svg\" alt=\"Pattern\">  Controls which sequencer pattern is being played back, allowing you to change patterns from within a preset by assigning an LFO or CV source to this parameter. If you add a slow rising saw to this parameter you can chain various patterns together. </p>\n<h4 id=\"step-offset\">Step Offset</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/pattern--step-offset.svg\" alt=\"Step Offset\">  Offsets the starting point of the sequencer pattern allowing for variations in sequencer playback.</p>\n<h2 id=\"modulation-a-b-x-and-y-inputs-lfo-s-\">Modulation A, B, X and Y (Inputs &amp; LFO&#39;s)</h2>\n<p>The next two rows controls the A/B  and X/Y modulators. Each are split so that <em>SHIFT TOP</em> and <em>SHIFT BOTTOM</em> access one of the two inputs.</p>\n<div>\n\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/a-b-cv-level.svg\" alt=\"AB SV Level\"> <img src=\"/manual-images/offset.svg\" alt=\"Offset\"> <img src=\"/manual-images/lfo--depth.svg\" alt=\"LFO Depth\"> <img src=\"/manual-images/lfo--rate.svg\" alt=\"LFO Rate\"> <img src=\"/manual-images/lfo--shape.svg\" alt=\"LFO Shape\"> <img src=\"/manual-images/lfo--symmetry.svg\" alt=\"LFO Symmetry\"> <img src=\"/manual-images/tap.svg\" alt=\"tap!\">  </p>\n</div>\n\n<ul>\n<li>CV A <em>SHIFT TOP</em> on the A/B row (pictured)</li>\n<li>CV B <em>SHIFT BOTTOM</em> on the A/B row</li>\n<li>CV X <em>SHIFT TOP</em> on the X/Y row</li>\n<li>CV Y <em>SHIFT BOTTOM</em> on the X/Y row</li>\n</ul>\n<h3 id=\"lfos-knobs\">LFOs &amp; Knobs</h3>\n<p><img src=\"/manual-images/lfo--depth.svg\" alt=\"LFO Depth\"> <img src=\"/manual-images/lfo--rate.svg\" alt=\"LFO Rate\"> <img src=\"/manual-images/lfo--shape.svg\" alt=\"LFO Shape\"> <img src=\"/manual-images/lfo--symmetry.svg\" alt=\"LFO Symmetry\">  Each input also has a dedicated built in LFO that is added on top so that these modulation sources can be useful even without any jacks plugged in. Finally, modulators A and B correspond to knobs A &amp; B, which offset these two values.</p>\n<h4 id=\"cv-level\">CV Level</h4>\n<p><img src=\"/manual-images/a-b-cv-level.svg\" alt=\"AB CV Level\"> <img src=\"/manual-images/x-y-cv-level.svg\" alt=\"XY CV Level\"> An attenuator for the signal coming from the corresponding CV input jacks.</p>\n<h4 id=\"offset\">Offset</h4>\n<p><img src=\"/manual-images/offset.svg\" alt=\"Offset\"> Offsets the CV and/or LFO. This is a constant voltage that is being added (or subtracted) from the sum of the CV input and the LFO.</p>\n<h4 id=\"lfo-depth\">LFO Depth</h4>\n<p><img src=\"/manual-images/lfo--depth.svg\" alt=\"LFO Depth\"> Attenuator for the internal LFO&#39;s.The default value is zero so turn this up for LFO&#39;s.</p>\n<h4 id=\"lfo-rate\">LFO Rate</h4>\n<p><img src=\"/manual-images/lfo--rate.svg\" alt=\"LFO Rate\"> Controls the rate of the internal LFO. The LFO rates can range from 20 sceonds (at +100%) to milliseconds at -100%. At 0% the rate is [y] milliseconds. </p>\n<h4 id=\"lfo-shape\">LFO Shape</h4>\n<p><img src=\"/manual-images/lfo--shape.svg\" alt=\"LFO Shape\">  Sets the shape of the LFO.</p>\n<h5 id=\"the-following-shapes-are-available-\">The following shapes are available:</h5>\n<ul>\n<li>Triangle</li>\n<li>Sine</li>\n<li>SmthRnd (Smooth Random)</li>\n<li>StepRnd (Stepped Random)</li>\n<li>BiSquare (Bipolar Square wave, -5v - +5v)</li>\n<li>Square (Unipolar Square wave 0v - +5v)</li>\n<li>Castle (-1 0 1 0 -1 0 1 0, kinda looks like a sandcastle...)</li>\n<li>BiTrigs (Trigger pulses in positive and negative direction)</li>\n<li>Trigs (Trigger Pulses in positive direction)</li>\n<li>Env</li>\n</ul>\n<h4 id=\"lfo-symmetry\">LFO Symmetry</h4>\n<p><img src=\"/manual-images/lfo--symmetry.svg\" alt=\"LFO Symmetry\">  Sets the slope of the LFO shape - for example turning a triangle wave into a sharp ramp up (symmetry +100) or down (symmetry -100). </p>\n<h2 id=\"mixer\">Mixer</h2>\n<h4 id=\"synth\">Synth</h4>\n<p><img src=\"/manual-images/synth.svg\" alt=\"Synth\">  Sets the gain level of Plinky&#39;s synth / sampler. Above 50% you will start hitting a limiter, which can help to glue patches with wide dynamic range together. You can use this as a volume control if you are taking audio from the left / mono output. </p>\n<h4 id=\"input\">Input</h4>\n<p><img src=\"/manual-images/input.svg\" alt=\"Input\">  Sets the gain level of Plinky&#39;s inputs. These inputs take line level signals and amplify them to Eurorack levels, but... If you feed it eurorack level, the analog saturation unit in Plinky V2 does it&#39;s thing. In case both the inputs on the face plate and the front/back side are used, Plinky mixes the inputs at fixed levels.</p>\n<h4 id=\"wet-dry\">Wet/Dry</h4>\n<p><img src=\"/manual-images/shift-top.svg\" alt=\"Shift Top\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/wet-dry.svg\" alt=\"Wet/Dry\">  Sets the balance between the dry signal of Plinky&#39;s voice (synth or sampler) and the wet signal of the Reverb and Delay units (the distortion/saturation device is applied directly to the 8 individual voices.) The default setting is zero where there is an equal mix of wet and dry signals. 100 is completely wet and -100 is completely dry.</p>\n<h4 id=\"input-fx\">Input FX</h4>\n<p><img src=\"/manual-images/shift-bottom.svg\" alt=\"Shift Bottom\"> <img src=\"/manual-images/hold.svg\" alt=\"hold...\"> <img src=\"/manual-images/wet-dry.svg\" alt=\"Input FX\">  Sets the balance between the dry signal of the audio inputs and the wet signal passing through the Reverb and Delay units.</p>\n<h4 id=\"high-pass-filter-hpf-\">High Pass Filter (HPF)</h4>\n<p><img src=\"/manual-images/hpf.svg\" alt=\"High Pass Filter\">  After the synth/sampler, external audio and the effects are mixed, they pass through a High Pass Filter. This parameter controls the cut off frequency.</p>\n<h4 id=\"cv-quantize\">CV Quantize</h4>\n<p><img src=\"/manual-images/cv-quantize.svg\" alt=\"CV Quantize\">  Plinky’s pitch input is most useful when you have a sequence or latched note playing; the pitch is transposed according to the pitch CV input (1 volt per octave), and you can use this last parameter to choose if the transposition is unquantized, quantized to semitones, or transposed in-scale. 0v (C0) means no transposition.</p>\n<h4 id=\"volume\">Volume</h4>\n<p><img src=\"/manual-images/volume.svg\" alt=\"Volume\">  Sets the level of the final output stage for the headphone out. Turn this up to 11.</p>\n<h4 id=\"empty-pad\">Empty Pad</h4>\n<p><img src=\"/manual-images/blank.svg\" alt=\"Accelrometer Sensitivity\">  Attenuator for the Accelerometer. This parameter controls how sensitive Plinky reacts to the accelerometer. The icon is left blank because this parameter will be moved to the settings menu, which will be included in a firmware update.</p>\n<h2 id=\"modulators\">Modulators</h2>\n<h4 id=\"modulator-base\">Modulator Base</h4>\n<p><img src=\"/manual-images/mod-src--base.svg\" alt=\"Modulator Base\">  Toggles between the selected modulator and the base parameter of a device. This way you can set both the base value, and the amount of modulation that is assigned to that parameter. </p>\n<h4 id=\"envelope-2\">Envelope 2</h4>\n<p><img src=\"/manual-images/mod-src--envelope-2.svg\" alt=\"Mod Source Envelope 2\">  An assignable ADSR envelope generator. Set it&#39;s Attack, Decay, Sustain, Release and peak level with the bottom parameters of the Envelope Generator. Envelope 1 is assigned to the sensitivity by default, but this second ADSR is unassigned by default.</p>\n<h4 id=\"pressure\">Pressure</h4>\n<p><img src=\"/manual-images/mod-src--sensitivity.svg\" alt=\"Mod Source Pressure\">  Modulate any parameter with the maximum pressure that is applied on each of the strings. Corresponds with the pressure bar in the right of screen.</p>\n<h4 id=\"modulator-a-b-x-and-y\">Modulator A, B, X and Y</h4>\n<p><img src=\"/manual-images/mod-src--a.svg\" alt=\"MODULATOR A\">  <img src=\"/manual-images/mod-src--b.svg\" alt=\"MODULATOR B\">  <img src=\"/manual-images/mod-src--x.svg\" alt=\"MODULATOR X\">  <img src=\"/manual-images/mod-src--y.svg\" alt=\"MODULATOR Y\">   These pads assign Modulator A, B, X and Y to parameters. Each of these modulators feature a CV input (which can be attenauted) and an LFO with extensive options. Modulator A &amp; B have physical knobs A &amp; B as extra offset, and Modulators X &amp; Y correspond to the X- and Y-axis of the accelerometer. </p>\n<h4 id=\"random\">Random</h4>\n<p><img src=\"/manual-images/mod-src--random.svg\" alt=\"random\">  Assigns (an amount of) randomness to parameters.</p>\n<h3 id=\"that-s-it-for-the-parameters-\">That&#39;s it for the parameters!</h3>\n<p>It&#39;s a bunch of information, but you&#39;ll get it quick!</p>\n<h1 id=\"midi-cv\">MIDI &amp; CV</h1>\n<h4 id=\"general\">General</h4>\n<p>Plinky responds to MIDI! It will show up as plinkysynth once you have plugged it into your computer, and will act as an 8-voice synthesizer. If you also bought the Expander for Plinky, this will respond to and output MIDI over TRS. Refer to the Expander part of the manual. Plinky listens to midi channel 1 by default. </p>\n<p>You can play Plinky while MIDI is being sent to it. Plinky will prioritise touch input over MIDI input, so you can jam over a pre-recorded MIDI pattern.</p>\n<h4 id=\"usb-midi-in\">USB Midi in</h4>\n<p>Here&#39;s a list of all the CC parameters that Plinky listens to.</p>\n<table>\n<thead>\n<tr>\n<th>CC</th>\n<th>Category</th>\n<th>Parameter</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>13</td>\n<td>Sound</td>\n<td>Shape</td>\n</tr>\n<tr>\n<td>4</td>\n<td>Sound</td>\n<td>Distortion</td>\n</tr>\n<tr>\n<td>9</td>\n<td>Sound</td>\n<td>Pitch</td>\n</tr>\n<tr>\n<td>14</td>\n<td>Sound</td>\n<td>Interval</td>\n</tr>\n<tr>\n<td>2</td>\n<td>Sound</td>\n<td>Noise level</td>\n</tr>\n<tr>\n<td>5</td>\n<td>Sound</td>\n<td>Glide</td>\n</tr>\n<tr>\n<td>71</td>\n<td>Sound</td>\n<td>Resonance</td>\n</tr>\n<tr>\n<td>3</td>\n<td>ENV 1</td>\n<td>Sensitivity (LPF amount)</td>\n</tr>\n<tr>\n<td>73</td>\n<td>ENV 1</td>\n<td>Attack</td>\n</tr>\n<tr>\n<td>74</td>\n<td>ENV 1</td>\n<td>Sustain</td>\n</tr>\n<tr>\n<td>75</td>\n<td>ENV 1</td>\n<td>Decay</td>\n</tr>\n<tr>\n<td>72</td>\n<td>ENV 1</td>\n<td>Release</td>\n</tr>\n<tr>\n<td>19</td>\n<td>ENV 2</td>\n<td>Level</td>\n</tr>\n<tr>\n<td>20</td>\n<td>ENV 2</td>\n<td>Attack</td>\n</tr>\n<tr>\n<td>21</td>\n<td>ENV 2</td>\n<td>Decay</td>\n</tr>\n<tr>\n<td>22</td>\n<td>ENV 2</td>\n<td>Sustain</td>\n</tr>\n<tr>\n<td>23</td>\n<td>ENV 2</td>\n<td>Release</td>\n</tr>\n<tr>\n<td>94</td>\n<td>FX - Delay</td>\n<td>Delay send amt</td>\n</tr>\n<tr>\n<td>12</td>\n<td>FX - Delay</td>\n<td>Delay time</td>\n</tr>\n<tr>\n<td>112</td>\n<td>FX - Delay</td>\n<td>Delay pingpong</td>\n</tr>\n<tr>\n<td>113</td>\n<td>FX - Delay</td>\n<td>Delay wobble</td>\n</tr>\n<tr>\n<td>95</td>\n<td>FX - Delay</td>\n<td>Delay feedback amt</td>\n</tr>\n<tr>\n<td>91</td>\n<td>FX - Reverb</td>\n<td>Reverb send amt</td>\n</tr>\n<tr>\n<td>92</td>\n<td>FX - Reverb</td>\n<td>Reverb time</td>\n</tr>\n<tr>\n<td>93</td>\n<td>FX - Reverb</td>\n<td>Reverb shimmer</td>\n</tr>\n<tr>\n<td>114</td>\n<td>FX - Reverb</td>\n<td>Reverb wobble</td>\n</tr>\n<tr>\n<td>102</td>\n<td>ARP</td>\n<td>On/off</td>\n</tr>\n<tr>\n<td>103</td>\n<td>ARP</td>\n<td>Order</td>\n</tr>\n<tr>\n<td>104</td>\n<td>ARP</td>\n<td>Clock division</td>\n</tr>\n<tr>\n<td>105</td>\n<td>ARP</td>\n<td>Chance</td>\n</tr>\n<tr>\n<td>106</td>\n<td>ARP</td>\n<td>Euclid length</td>\n</tr>\n<tr>\n<td>107</td>\n<td>ARP</td>\n<td>Octaves</td>\n</tr>\n<tr>\n<td>108</td>\n<td>SEQ</td>\n<td>Order</td>\n</tr>\n<tr>\n<td>109</td>\n<td>SEQ</td>\n<td>Clock division</td>\n</tr>\n<tr>\n<td>110</td>\n<td>SEQ</td>\n<td>Chance</td>\n</tr>\n<tr>\n<td>111</td>\n<td>SEQ</td>\n<td>Euclid length</td>\n</tr>\n<tr>\n<td>11</td>\n<td>SEQ</td>\n<td>Gate length</td>\n</tr>\n<tr>\n<td>83</td>\n<td>SEQ</td>\n<td>Pattern</td>\n</tr>\n<tr>\n<td>85</td>\n<td>SEQ</td>\n<td>Steps</td>\n</tr>\n<tr>\n<td>15</td>\n<td>Sampler</td>\n<td>Scrub</td>\n</tr>\n<tr>\n<td>16</td>\n<td>Sampler</td>\n<td>Grain size</td>\n</tr>\n<tr>\n<td>17</td>\n<td>Sampler</td>\n<td>Play speed</td>\n</tr>\n<tr>\n<td>18</td>\n<td>Sampler</td>\n<td>Timestretch</td>\n</tr>\n<tr>\n<td>82</td>\n<td>Sampler</td>\n<td>Sample</td>\n</tr>\n<tr>\n<td>116</td>\n<td>Sampler</td>\n<td>Jitter position</td>\n</tr>\n<tr>\n<td>117</td>\n<td>Sampler</td>\n<td>Jitter grain size</td>\n</tr>\n<tr>\n<td>118</td>\n<td>Sampler</td>\n<td>Jitter rate</td>\n</tr>\n<tr>\n<td>119</td>\n<td>Sampler</td>\n<td>Jitter pulse</td>\n</tr>\n<tr>\n<td>24</td>\n<td>A</td>\n<td>Offset</td>\n</tr>\n<tr>\n<td>25</td>\n<td>A</td>\n<td>Depth</td>\n</tr>\n<tr>\n<td>26</td>\n<td>A</td>\n<td>Rate</td>\n</tr>\n<tr>\n<td>27</td>\n<td>B</td>\n<td>Offset</td>\n</tr>\n<tr>\n<td>28</td>\n<td>B</td>\n<td>Depth</td>\n</tr>\n<tr>\n<td>29</td>\n<td>B</td>\n<td>Rate</td>\n</tr>\n<tr>\n<td>78</td>\n<td>X</td>\n<td>Offset</td>\n</tr>\n<tr>\n<td>77</td>\n<td>X</td>\n<td>Depth</td>\n</tr>\n<tr>\n<td>76</td>\n<td>X</td>\n<td>Rate</td>\n</tr>\n<tr>\n<td>81</td>\n<td>Y</td>\n<td>Offset</td>\n</tr>\n<tr>\n<td>80</td>\n<td>Y</td>\n<td>Depth</td>\n</tr>\n<tr>\n<td>79</td>\n<td>Y</td>\n<td>Rate</td>\n</tr>\n<tr>\n<td>89</td>\n<td>Mixer</td>\n<td>IN volume</td>\n</tr>\n<tr>\n<td>90</td>\n<td>Mixer</td>\n<td>IN wet/dry amt</td>\n</tr>\n<tr>\n<td>31</td>\n<td>Mixer</td>\n<td>HPF amt</td>\n</tr>\n<tr>\n<td>7</td>\n<td>Mixer</td>\n<td>Synth level</td>\n</tr>\n<tr>\n<td>8</td>\n<td>Mixer</td>\n<td>Wet/dry</td>\n</tr>\n</tbody></table>\n<h4 id=\"usb-midi-out\">USB Midi out</h4>\n<p>Plinky supports MIDI out over USB. Plinky’s implementation has polyphonic aftertouch.</p>\n<h4 id=\"power\">Power</h4>\n<p>Plinky can be powered over USB. Make sure you do not combine eurorack and USB-power. </p>\n<h1 id=\"eurorack\">Eurorack</h1>\n<p>Plinky (V2) fits in standard Eurorack rails. It can be powered over Eurorack, but make sure not to combine USB and eurorack power supplies. Plinky has dedicated inputs and outputs to communicate with (semi-)modular gear. Read the description well, because some of the implementations differ slightly from what’s usual in Eurorack (mostly Gate).</p>\n<p>The 8 jack inputs, at left, from top to bottom provide:</p>\n<h4 id=\"clock-input\">Clock Input</h4>\n<p>A 1/16th note clock input. Plinky responds to 2PPQN audio pulses. As soon as Plinky receives a clock in the Arpegiator / Sequencer will start playing. Other clocked devices (delay, in the future possibly the LFO’s) will switch back to the internal clock as soon as the external clock stops. </p>\n<h4 id=\"gate-input\">Gate Input</h4>\n<p>An analogue gate that scales the openness of all low pass gates (0-5v).</p>\n<h4 id=\"pitch-input\">Pitch Input</h4>\n<p>A pitch input for transposition via a V/oct input in -2v to 5v range (with quantization controlled by the u secondary parameter).</p>\n<h4 id=\"a-b-x-y-inputs\">A, B, X, Y Inputs</h4>\n<p>Modulation (A, B, X, Y) with -5v to 5v range</p>\n<h4 id=\"audio-input\">Audio Input</h4>\n<p>An audio input that is mixed with the synth output as well as being sent to the FX units. </p>\n<h4 id=\"left-mono-output\">Left / Mono Output</h4>\n<p>An audio output, at Eurorack level, mono (left channel)</p>\n<h4 id=\"right-output\">Right Output</h4>\n<p>An audio output, at Eurorack level, mono (right channel)</p>\n<h4 id=\"clock-output\">Clock Output</h4>\n<p>Outputs the clock, which is controlled by the BPM parameter. [outputs at 2 pulses per beat]</p>\n<h4 id=\"trigger-output\">Trigger Output</h4>\n<p>Outputs a trigger signal on for each of the notes played (by hand, arpeggiator or sequencer)</p>\n<h4 id=\"pitch-hi-output\">Pitch Hi Output</h4>\n<p>This is a 1v/oct CV signal that plays all the notes that are currently being played.</p>\n<h4 id=\"gate-output\">Gate Output</h4>\n<p>Outputs a gate signal. As long as one of the pads is being touched, a 5v signal is being generated.</p>\n<h4 id=\"pitch-lo-output\">Pitch Lo Output</h4>\n<p>A 1v/oct CV signal that outputs only the lowest note that is currently being played.</p>\n<h4 id=\"pressure-output\">Pressure output</h4>\n<p>A CV signal that outputs highest amount of pressure that is currently being put on either one of the strings. This corresponds to the &#39;pressure bar&#39; on the right side of the screen.</p>\n<h1 id=\"the-expander\">The Expander</h1>\n<p>The Plinky Expander is a 4HP Eurorack module that adds a bunch of funtionality to Plinky, mostly to interface even better with the rest of your Eurorack setup. The following features will be included in the first version of the firmware:</p>\n<h4 id=\"trs-midi-input\">TRS Midi Input</h4>\n<p>Gate and 1v/oct MIDI input, both Korg and Arturia standards (A and B) are supported. </p>\n<h4 id=\"trs-midi-output\">TRS Midi Output</h4>\n<p>Gate and 1v/oct MIDI output, both Korg and Arturia standards (A and B) are supported. </p>\n<h4 id=\"a-b-x-y-outputs\">A, B, X, Y Outputs</h4>\n<p>4 jacks that output the A, B, X and Y signals as CV. </p>\n<h1 id=\"patch-import-export\">Patch Import / Export</h1>\n<p>You can import and export patches via the web editor:\n<a target=\"_blank\" rel=\"nofollow\" href=\"https://plinkysynth.github.io/editor/\">https://plinkysynth.github.io/editor/</a></p>\n","date":"2021-01-24T08:38:00.000Z","excerpt":"","printDate":"January 24, 2021","toc":[{"anchor":"plinky-manual","level":1,"text":"Plinky Manual"},{"anchor":"quick-start-guide","level":2,"text":"Quick Start Guide"},{"anchor":"powering-plinky","level":3,"text":"Powering Plinky"},{"anchor":"calibrating-plinky","level":3,"text":"Calibrating Plinky"},{"anchor":"connect-your-headphones-or-speakers","level":3,"text":"Connect your Headphones or Speakers"},{"anchor":"play-plinky-","level":3,"text":"Play Plinky!"},{"anchor":"changing-the-sound","level":3,"text":"Changing the Sound"},{"anchor":"adding-modulation","level":3,"text":"Adding Modulation"},{"anchor":"plinky-hardware","level":1,"text":"Plinky hardware"},{"anchor":"top-and-bottom-edge","level":2,"text":"Top and bottom edge"},{"anchor":"audio-in-line-level-stereo-","level":4,"text":"Audio in (line level stereo)"},{"anchor":"usb","level":4,"text":"USB"},{"anchor":"audio-out-line-level-stereo-","level":4,"text":"Audio out (line level stereo)"},{"anchor":"main-interface","level":2,"text":"Main Interface"},{"anchor":"top-row","level":3,"text":"Top Row"},{"anchor":"knobs-a-b","level":4,"text":"Knobs A &amp; B"},{"anchor":"screen","level":4,"text":"Screen"},{"anchor":"encoder","level":4,"text":"Encoder"},{"anchor":"columns-of-jacks","level":3,"text":"Columns of Jacks"},{"anchor":"bottom-row-shift-keys-","level":3,"text":"Bottom Row (Shift Keys)"},{"anchor":"shift-top-shift-bottom","level":4,"text":"Shift Top &amp; Shift Bottom"},{"anchor":"preset","level":4,"text":"Preset"},{"anchor":"previous","level":4,"text":"Previous"},{"anchor":"next","level":4,"text":"Next"},{"anchor":"clear","level":4,"text":"Clear"},{"anchor":"record-and-play","level":4,"text":"Record and Play"},{"anchor":"center-pads-leds","level":3,"text":"Center Pads &amp; LEDs"},{"anchor":"parameters","level":1,"text":"Parameters"},{"anchor":"sound-synthesizer-","level":1,"text":"Sound (Synthesizer)"},{"anchor":"shape","level":4,"text":"Shape"},{"anchor":"noise","level":4,"text":"Noise"},{"anchor":"drive","level":4,"text":"Drive"},{"anchor":"resonance","level":4,"text":"Resonance"},{"anchor":"pitch","level":4,"text":"Pitch"},{"anchor":"degree","level":4,"text":"Degree"},{"anchor":"octave","level":4,"text":"Octave"},{"anchor":"scale","level":4,"text":"Scale"},{"anchor":"the-following-scales-are-available-","level":4,"text":"The following Scales are available:"},{"anchor":"glide","level":4,"text":"Glide"},{"anchor":"microtone","level":4,"text":"Microtone"},{"anchor":"osc-interval","level":4,"text":"Osc Interval"},{"anchor":"stride-column-","level":4,"text":"Stride (Column)"},{"anchor":"envelope-generator","level":2,"text":"Envelope Generator"},{"anchor":"sensitivity","level":4,"text":"Sensitivity"},{"anchor":"envelope-2-level","level":4,"text":"Envelope 2 Level"},{"anchor":"attack-1-2","level":4,"text":"Attack 1 &amp; 2"},{"anchor":"decay-1-2","level":4,"text":"Decay 1 &amp; 2"},{"anchor":"sustain-1-2","level":4,"text":"Sustain 1 &amp; 2"},{"anchor":"release-1-2","level":4,"text":"Release 1 &amp; 2"},{"anchor":"master-effects","level":2,"text":"Master Effects"},{"anchor":"delay-send","level":4,"text":"Delay Send"},{"anchor":"delay-time","level":4,"text":"Delay Time"},{"anchor":"delay-ratio","level":4,"text":"Delay Ratio"},{"anchor":"delay-wobble","level":4,"text":"Delay Wobble"},{"anchor":"delay-feedback","level":4,"text":"Delay Feedback"},{"anchor":"reverb-send","level":4,"text":"Reverb Send"},{"anchor":"reverb-time","level":4,"text":"Reverb Time"},{"anchor":"shimmer","level":4,"text":"Shimmer"},{"anchor":"reverb-wobble","level":4,"text":"Reverb Wobble"},{"anchor":"arpeggiator-sequencer","level":2,"text":"Arpeggiator &amp; Sequencer"},{"anchor":"tempo-bpm","level":4,"text":"Tempo / BPM"},{"anchor":"swing","level":4,"text":"Swing"},{"anchor":"latch","level":4,"text":"Latch"},{"anchor":"arpeggiator","level":3,"text":"Arpeggiator"},{"anchor":"arpeggiator-mode-order-top-","level":4,"text":"Arpeggiator Mode / Order (Top)"},{"anchor":"the-following-arpeggiator-modes-are-available-","level":4,"text":"The following arpeggiator modes are available:"},{"anchor":"arpeggiator-clock-division","level":4,"text":"Arpeggiator Clock Division"},{"anchor":"arpeggiator-chance-density-top-","level":4,"text":"Arpeggiator Chance / Density (top)"},{"anchor":"arpeggiator-euclidian-length-top-","level":4,"text":"Arpeggiator Euclidian Length (top)"},{"anchor":"arpeggiator-octaves","level":4,"text":"Arpeggiator Octaves"},{"anchor":"sequencer","level":3,"text":"Sequencer"},{"anchor":"sequencer-mode-order","level":4,"text":"Sequencer Mode / Order"},{"anchor":"sequencer-clock-division","level":4,"text":"Sequencer Clock Division"},{"anchor":"sequencer-chance-density","level":4,"text":"Sequencer Chance / Density"},{"anchor":"sequencer-euclidian-length","level":4,"text":"Sequencer Euclidian Length"},{"anchor":"sequencer-gate-length","level":4,"text":"Sequencer Gate Length"},{"anchor":"sampler","level":2,"text":"Sampler"},{"anchor":"scrub","level":4,"text":"Scrub"},{"anchor":"scrub-jitter","level":4,"text":"Scrub Jitter"},{"anchor":"grain-size","level":4,"text":"Grain Size"},{"anchor":"grain-size-jitter","level":4,"text":"Grain Size Jitter"},{"anchor":"play-speed","level":4,"text":"Play Speed"},{"anchor":"play-speed-jitter","level":4,"text":"Play Speed Jitter"},{"anchor":"time-stretch","level":4,"text":"Time Stretch"},{"anchor":"sample","level":4,"text":"Sample"},{"anchor":"pattern","level":4,"text":"Pattern"},{"anchor":"step-offset","level":4,"text":"Step Offset"},{"anchor":"modulation-a-b-x-and-y-inputs-lfo-s-","level":2,"text":"Modulation A, B, X and Y (Inputs &amp; LFO&#39;s)"},{"anchor":"lfos-knobs","level":3,"text":"LFOs &amp; Knobs"},{"anchor":"cv-level","level":4,"text":"CV Level"},{"anchor":"offset","level":4,"text":"Offset"},{"anchor":"lfo-depth","level":4,"text":"LFO Depth"},{"anchor":"lfo-rate","level":4,"text":"LFO Rate"},{"anchor":"lfo-shape","level":4,"text":"LFO Shape"},{"anchor":"the-following-shapes-are-available-","level":5,"text":"The following shapes are available:"},{"anchor":"lfo-symmetry","level":4,"text":"LFO Symmetry"},{"anchor":"mixer","level":2,"text":"Mixer"},{"anchor":"synth","level":4,"text":"Synth"},{"anchor":"input","level":4,"text":"Input"},{"anchor":"wet-dry","level":4,"text":"Wet/Dry"},{"anchor":"input-fx","level":4,"text":"Input FX"},{"anchor":"high-pass-filter-hpf-","level":4,"text":"High Pass Filter (HPF)"},{"anchor":"cv-quantize","level":4,"text":"CV Quantize"},{"anchor":"volume","level":4,"text":"Volume"},{"anchor":"empty-pad","level":4,"text":"Empty Pad"},{"anchor":"modulators","level":2,"text":"Modulators"},{"anchor":"modulator-base","level":4,"text":"Modulator Base"},{"anchor":"envelope-2","level":4,"text":"Envelope 2"},{"anchor":"pressure","level":4,"text":"Pressure"},{"anchor":"modulator-a-b-x-and-y","level":4,"text":"Modulator A, B, X and Y"},{"anchor":"random","level":4,"text":"Random"},{"anchor":"that-s-it-for-the-parameters-","level":3,"text":"That&#39;s it for the parameters!"},{"anchor":"midi-cv","level":1,"text":"MIDI &amp; CV"},{"anchor":"general","level":4,"text":"General"},{"anchor":"usb-midi-in","level":4,"text":"USB Midi in"},{"anchor":"usb-midi-out","level":4,"text":"USB Midi out"},{"anchor":"power","level":4,"text":"Power"},{"anchor":"eurorack","level":1,"text":"Eurorack"},{"anchor":"clock-input","level":4,"text":"Clock Input"},{"anchor":"gate-input","level":4,"text":"Gate Input"},{"anchor":"pitch-input","level":4,"text":"Pitch Input"},{"anchor":"a-b-x-y-inputs","level":4,"text":"A, B, X, Y Inputs"},{"anchor":"audio-input","level":4,"text":"Audio Input"},{"anchor":"left-mono-output","level":4,"text":"Left / Mono Output"},{"anchor":"right-output","level":4,"text":"Right Output"},{"anchor":"clock-output","level":4,"text":"Clock Output"},{"anchor":"trigger-output","level":4,"text":"Trigger Output"},{"anchor":"pitch-hi-output","level":4,"text":"Pitch Hi Output"},{"anchor":"gate-output","level":4,"text":"Gate Output"},{"anchor":"pitch-lo-output","level":4,"text":"Pitch Lo Output"},{"anchor":"pressure-output","level":4,"text":"Pressure output"},{"anchor":"the-expander","level":1,"text":"The Expander"},{"anchor":"trs-midi-input","level":4,"text":"TRS Midi Input"},{"anchor":"trs-midi-output","level":4,"text":"TRS Midi Output"},{"anchor":"a-b-x-y-outputs","level":4,"text":"A, B, X, Y Outputs"},{"anchor":"patch-import-export","level":1,"text":"Patch Import / Export"}]}